[
    {
        "date": "20 Jan 2014", 
        "star": "4", 
        "description": "Dell being No.1 does it's job pretty well with this new generation Inspirion 15. The machine is decently priced for the features it has. I will make it short by giving the pros &amp; cons.Pros1. Excellent Battery Back up - Only 6 cell battery laptop (rest are all 4 cell) with ultra processor gives me back up of around 5.5 hrs with mixed usage2. Dell Service Support3. Original Windows 84. Multi Gesture touch pad5. Excellent key board - very good for long emails6. 4 USB point (2 are 3.0 compatible)Cons1. Screen is not ultra vivid like sony2. Sound quality good for watching movies but not really a home entertainment (not really a con since most laptop are like this)3. 15 inches is big to my taste - I wanted a 14 incher but that's being stopped by Dell in inspirion series4. Built Quality is not at par to old Dell laptops but is still among best ones5. The looks are not really you would ever fall for. Dell has kept it functional and basic more so with scratch resistant body.Laptop Brands I have used so far.HP, Dell, Acer (2 laptops )For the price and research I had done Flipkart was the best vendor and Dell was the best laptop:)"
    }, 
    {
        "date": "22 Oct 2013", 
        "star": "5", 
        "description": "I bought this laptop during this Dasara/Diwali offers costing at 29500/-, 1000 gift Voucher and Dell backpack.Flipkart Delivery was fast, got it in 1.5 days.Pros :Very light weight, keys in keyboard are adequately spaced and good for medium usage of keyboard.The sound quality and viewing angles are good.Touchpad sensitivity is smooth and comfortable.The battery backup is around 5 hrs on continuous usage.Cons :I feel the there are some visible touch impressions on the screen lid and also around the touchpad."
    }, 
    {
        "date": "06 Dec 2013", 
        "star": "4", 
        "description": "I bought this product after reviewing a lot of deals in the market during Diwali time. I found the best deal on flipkart. And luckily I had the Stan Chart card as well so I could avail the discount offer too after the 500/- instant discount that flipkart gave.Laptop is decent for home use. I have been using it for a month and its working fine and I am liking it. I have been using a lenovo laptop for last 5 years and I like this one better than that one.Also special mention to the flipart delivery - I was leaving for out of town in a couple of days after my order and it so I happened that I had a mistake while entering my pincode so it went to the wrong warehouse. But when I spoke to the Vashi depo incharge Mr Pravin and explained my situation, he was more than eager to do the needful and have my product delivered that very evening. Flipkart, you guys rock!!! Awesome....I look forward to shop more frequently from you guys with the wonderful start!"
    }, 
    {
        "date": "14 Sep 2013", 
        "star": "4", 
        "description": "I am a college student and I wanted a laptop under 35000/-My requirements included watching movies, browsing internet and using softwares like matlab, xilinx, Turbo C etc.I searched various brands and finally I settled down on this one...I'm very satisfied by the laptop.Although it doesn't have a dedicated graphic card but still intel hd 4000 is much more than sufficient if you are not looking to play heavy games.Pros:Excellent battery backupVery good speakersreasonable configuration under 35000/-(1 year mcafee subscription, windows 8)ConsThe laptop's outer surface picks up thumb impressions and sweat marks very easily and it doesn't look clean as a result.The bottomline is go for this if you are low on budget and can do without heavy games..."
    }, 
    {
        "date": "30 Mar 2014", 
        "star": "5", 
        "description": "Dell being No.1 does it's job pretty well with this new generation Inspirion 15. The machine is decently priced for the features it has. I will make it short by giving the pros &amp; cons.Pros1. Excellent Battery Back up - Only 6 cell battery laptop (rest are all 4 cell) with ultra processor gives me back up of around 5.5 hrs with mixed usage2. Dell Service Support3. Original Windows 84. Multi Gesture touch pad5. Excellent key board - very good for long emails6. 4 USB point (2 are 3.0 compatible)Cons1. Screen is not ultra vivid like sony2. Sound quality good for watching movies but not really a home entertainment (not really a con since most laptop are like this)3. 15 inches is big to my taste - I wanted a 14 incher but that's being stopped by Dell in inspirion series4. Built Quality is not at par to old Dell laptops but is still among best ones5. The looks are not really you would ever fall for. Dell has kept it functional and basic more so with scratch resistant body.Laptop Brands I have used so far.HP, Dell, Acer (2 laptops )NICE BATTERY LIFE 6HRS"
    }, 
    {
        "date": "11 Nov 2013", 
        "star": "5", 
        "description": "Yes, I would recommend this productI love this laptop. This is my second laptop, and this is awesome the Intel Core i3 Processor provides very fast and powerful performance for my Inspiron 15. My laptop is ideal for students like me and I would recommend this laptop to anyoneAnd this laptop is selling out very fast in our country. The Quality of the Display is very bright and vivid. The Touchpad is very responsive and the Sound Quality is Superb! Overall the best Value for the Money. You will never go wrong with this laptop. Inspiron 15 is a Spectacular Laptop.Thank you Dell For making a very good laptop like this, Thank You Dell.Pros : Very good sound quality, very fast processor, high-quality display, very good touchpad and keyboard, overall very good performance, best ever value for the moneyCons : Heats a little but if you a cool pad it is fixed, nothing more to say about it."
    }, 
    {
        "date": "23 Apr 2014", 
        "star": "4", 
        "description": "I WILL LIST OUT PROS &amp; CONS:-Pros :-1. A good battery Life around 5 hours (only when screen is kept on low brightness mode + u are not watching any video + u are not using any usb connection + u r not accesing internet) else on an average u will get 3 hours of battery life.2. Screen Brightness is too good. Watching movies is a treat.3. Audio output with headset or any other Speaker is very loud and clear. Listening to songs is a treat.4. Computer does not heat at all. I had used this lappy continuously for 16 hours without keeping cooling pad below, but still it was not at all heated up.5. Keyboard is spacious. Only problem is Toggle arrows(up,down,right,left keys) provided are of very small size, so sometimes it becomes clumsy to use.6. System takes only seconds to switch on and shutting down takes hardly 5-10 seconds7. Windows 8 is great to work with.The best product in this price range for sure.Cons :-1. Performance of the laptop in terms of processing speed is not up to the mark. As sometimes it gets hang(but not for a long time).2. Output of Internal Speakers of this Laptop is not loud and clear.3. Pre-installed antivirus McAfee is not worthy to use, as it is not good in cleaning worms. You need to buy any other Antivirus.4. Battery charges up very slowly. It takes almost around 2.5 - 4 hours to fully charge from 10%.Overall you can just cope up with the cons and relish the pros !!FLIPKART DELIVERY WAS AWESOME. THEY ESTIMATED 6 DAYS TIME FOR DELIVERING IT BUT DELIVERED IT IN 3 DAYS.BUY IT ONLINE AS THE PRICES ARE LESS AS COMPARED TO COMPUTER SHOPS."
    }, 
    {
        "date": "17 Feb 2014", 
        "star": "5", 
        "description": "Well I am using this laptop since July 2013, Earlier I used to have (Dell Inspiron 1525) and I was very much satisfied with that. but using this (Dell Inspiron 15/3521) has made me feel even more satisfied with its solid performance in almost every department..Pros:1.Good Build Quality (very Slim than its competitor)2.Screen is Awesome3. Battery backup is more than enough (4 to 5 hrs.)4. Runs mid ranged games without any lag.5. I am using more than 50 different software (some are very heavy in nature) but the performance is quite commendable.6. Keyboard is very soft and touchpad is very very responsive.7. Multiple zoom, Image Rotation, web page zoom by finger flip is an ease to use.Additionally comes with one year full damage warranty covered.Cons:No cons as per the price for this beauty from Dell."
    }, 
    {
        "date": "07 May 2014", 
        "star": "1", 
        "description": "Hello All,I am a Dell user from last 10 years and had bought this new Inspiron 15. But this time I am not satisfy with the performance. Eventually, this is possible the problem comes through its OS i.e. Windows 8.1. You can not create a wi-fi network directly as you can do with Windows 7. Apart from this this system doesn't feel you as advance system. PC runs so slow as you were working on some Celeron system. Again, I am saying might the problem causes due to Windows 8.1 but still the whole system runs slow as compare to just previous version of Dell Laptops. Even Flipkart has delivered it before time and my other Dell PCs are working fine."
    }, 
    {
        "date": "11 Dec 2013", 
        "star": "2", 
        "description": "Flipkart is a very big name now a days in online electronics shopping but I had a very bad experience. I bought this laptop for my brother to gift him on his b'day but i got a defected product. Touch pad was not working properly. Hence contacted Dell and and got a new system with higher configuration(Win8.1+1GB Graphics).But flipkart delivery is good.  Received this product in 1.5 days.Laptop:-Product is good in this range.Camera and Sound good.Speed, better then other product in this config.Overall good product........ I am happy but after replacement. For product 4 StarThanks flipkart for a defected product and thanks Dell for a good product.Flipkart:- Please request your vendor not to sell defected one."
    }
]