[
    {
        "date": "25 May 2014", 
        "star": "5", 
        "description": "(not just value,its gold for money) !!!this is the best gaming laptop in this price range no doubt about thatits core i7 version is of course better in performance but its not worth the extra 20k surely,as the-1.Screen size2.Resolution3.Camera4.RAM,5.HDD6.OS7.Sexy red baclit keyboard8.Optical drive(very important nowadays as u dont get it,i dont know why they do that,its not like DVD's have dissapeared from the computer era)9.The looks10.The GPU(most important !)ARE ALL EXACLTLY THE SAME IN THE i5 AND i7 MODELSBATTERY LIFE is 5HRS in the i5 model and 3HRS in the i7(of course!!!)only advantage of the i7 model is that it has a VGA port (CMON WHO NEEDS THAT ? !!!)The difference is just the core i5 and i7(cache speed,processing speed)if u are a gamer u should know that the processor does not effect the gaming performance as such(untill its too bad or old like if u try comparing pentium 4 or dual core with i7 or i5)well i5 or i7 does not effect the gaming fluidity or fps visible.it only affects the loading time and world graphic detail loading,character loading etc and believe me it does'nt affect that much if u have i5 or the i7.all im saying is that this is the best and i7 model is not worth the extra 20kif u still wanna show off or burn or destroy your money go ahead buy the i7 ;)"
    }, 
    {
        "date": "24 Feb 2014", 
        "star": "5", 
        "description": "Yes, it has dvd drive.... its ultrabay you were talking about, where you can swap your dvd drive with an extra gpu or fan or hard drive.... and most importantly, it has GT 755M , not GT 750M !!!I m using this laptop and games are running flawlessly !!!"
    }, 
    {
        "date": "16 Apr 2014", 
        "star": "4", 
        "description": "Its a definite yes if you want a laptop with gaming capability of a descent gaming rig .I bought from lenovo shop. Price was same . Plus point was , i made 780 Rs for 2 yrs extended warranty (which is around 3k if you buy it seperately) , and got a lenovo bag too .Its been only 24hrs since i bought it but some facts can be laid upon immediately.Pros:1) Feels light and sturdy. With a mix of metal and plastic finish , its a tank .2) Screen resolution is 1920*1080..So HD videos &amp; movies look great .3) Keyboard is really comfi to type .4) OS is Windows 8. But upgrade is readily available to 8.1 . Do it &amp; scare away the blemishes of Windows 8 .5) Battery lasted a good 3 hr on heavy usage6) Super fast. 8gb ram , core i5 &amp; 2gb graphics make working on laptop really smooth .Cons:1) Screen glossy . Could have given Matt type screen .2) Power brick size bigger. (Wont matter much although)3) No power on indication on power brick .4) Placement of Caps lock , num lock indicator are in front, which is a little hard to spot immediately .5) Dedicated button to turn on/off wifi/bluetooth would have been good.6) Lot of useless software and anti - virus makes the laptop slower at first..Get rid of all that shit as fast as you can .7) Could not find a scroll area marked on touchpad...Other lenovo have that marked on right side of touchpad. It makes scroll little hard . You have make some settings to make it work according to your preference (first normal)Thanks"
    }, 
    {
        "date": "13 May 2014", 
        "star": "5", 
        "description": "First of all a few clarifications for a few people out there wondering about the exact specifications. I got my Unit delivered yesterday (12-05-2014) and the manufacturing date on the box is Dec 2013.. The laptop i received has a Gefore GT 755M n not a 750 as mentioned in the specs on Flipkarkts page. And this unit comes with an DVD RW in its Ultrabay. You can anytime remove the dvd drive n replace it with a cooler or a HDD or another graphic card. Now lets do Pros n ConsPros :1. Value for Money - I cannot stress enough how good this laptop is for the price. (I got it for 56k)2. Build Quality - Its built with brushed metal so its sturdy n durable. But the bottom n sides are made of plastic, but u hardly will be looking at those parts of the laptop3. Sound - JBL speakers are fine, one of the best in the market ryt now. But its not mind blowing or something. The real magic happens when you connect a decent pair of headphones to the laptop. The Dolby home theater kicks in and movies sound insaley crisp. I saw the movie 300 and i could hear the leaves creek and the wind wooshing, and all of this in surround sound.4. Screen - Full HD screen is a must on laptops cmon. All the 5 inch smartphones has a 1080p screen these days. So u will obviously need one on a 15 inch laptop. Good viewing angles too.5. Keyboard - This is the most favourite thing about this laptop for me. Not just cuz it glows in an awesome red colour, but also cuz of the feel u get wen u press the key. Really slick.Cons:1. Finger Print Magnet - I have praised it for its metallic construction, but i find it really hard to keep the lid and the palm rest clean. I havent used it for 24hrs yet and there r finger prints as if i have been using it for months.2. Heavy - weighing at 2.7 kgs its not the lightest or the thinnest laptop out there. But considering the specs it packs it is fairly thin. Especially wen compared to some other gaming laptops.3. Battery Life - Using the laptop just for generic purposes like web suring n movie watchin n listenin music, yu get around 5hrs. Which in this day and age, espically with Haswell processors is not upto the mark. And wen you play games and do video editing or photoshop u can expect only 2.5hrs of battery. So this might be a problem for a few people.Those are the only cons this laptop has really. I believe it can easily be overlooked considering what it can do and at what price you are getting it for.I havent gamed yet, but with 2gb of 755M im sure i could play any game out there in Medium to High settings. Some of the games can be played at Ultra settings too but that will drop your frame rates."
    }, 
    {
        "date": "05 Mar 2014", 
        "star": "5", 
        "description": "i dnt knw why people cant luk at price performace ratio...they are goin for an 80k laptop having i7 or touch..those system sold by tag of &quot;gaming laptop&quot; ..but the main thing required for gaming is gpU...this machine in 65k have an nvidia gtx 750..unlike those 8750s nd 740 in other brands ....they are just bottleneck for their i7..BUT here everythng is made for each other...so guys plz dnt waste your mony on &quot;expensive wanna be gaming laptops&quot;..if u want serious performance go for MSI,ASUS,Alienware but if u want a budget go for this machine"
    }, 
    {
        "date": "28 May 2014", 
        "star": "4", 
        "description": "i have purchasd the laptop a month back..till now there is no problm..i am very much fond of the laptop.Overall its a complete laptop with its all sound(jbl speaker),and 2gb nvidia graphics,screen resolution also of 1920x1080.particulary i purchased the laptop by seeing its processing speed , excellent exhaust, and the graphics.pros:-good display.-good exhaust to keep the laptop cool.-processor is heavy duty(on powersaver mode it works on 0.75ghz clock pulse,on balance mode it works on 1.7ghz clock pulse,on highperformance mode it works on 3.1ghz clock pulse) so, the turbo boost is working fine.-keybord is nice to work.-all the drivers for w7,w8 is available at lenevo site.-1tb hardisk..and it also support more than 3 primary partition..which generally common harddisk doesnt support.-jbl speaker quality is good.-backlit keyboard is comfortable to work with at dark.-i have talked with the lenevo support guys..personaly i feel satisfied with the lenevo support till now..cons:-very very very heavy as a laptop..it always give me a backpain.-the speaker sound is a bit low..that what i can feel..my last dell studio laptop has more volume than this for sure..although the quality of the sound is good.-the touchpad is uncomfortable..it is a whole component with left and right click all together..as a developer its a bit difficult to work with out right and left click,for that i need to carry a wireless mouse every where.atlast i can say that, it worth ur invest..at least i m happy, except for  a few things.and battery never consider as a criteria, because the processor with high clock pulse need more power, for their full performance..although at power saver mode(0.7gh clockpulse) it give around 4hrs."
    }, 
    {
        "date": "21 Jun 2014", 
        "star": "4", 
        "description": "I bought this laptop approximately 1.5 months back and waited testing all it's pros and cons before posting a review.1. Full HD can be sensed easily when you watch a movie, or play a game at its highest resolution or put up a very detailed wallpaper on desktop.2. The sound through speakers though sounds great but it lacks bass. The sound is relatively loud as compared to other laptops.3. Ample RAM, system never slows down or hangs. Multitasking at its best.4. The touchpad is shit. You touch, it gets clicked. You click, it doesn't even get touched. Lol.5. The laptop never overheats at its base. But the side vent ejects too much heat because of which the area around the ASD keys gets too hot and it feels uncomfortable to play games for long.6. There is no setting as such to stop the battery from charging.7. When you plug in to charge the laptop,  a white LED glows. But it never gets turned off even though your laptop has got fully charged. You'll not be able to figure out the actual battery level until you turn on the monitor.8. 5200 RPM HDD actually operates fast. Almost no lag in your double click and a file/folder getting opened.9. The web cam is good.10. The bag that comes along with this laptop is also good quality and spacious.11. As mentioned, the graphic card is wrong. It is 755 which renders graphics damn smooth.I have tried this laptop with most of today's HD games and I feel I made a good choice buying this laptop.In a nutshell, laptop is best in its performance, though certain tweaking could have been done by lenovo to customize the apps in a better way."
    }, 
    {
        "date": "20 Apr 2014", 
        "star": "4", 
        "description": "First FlipKart delivery - I purchased it from a seller on Sat, he confirmed it on Sun, packed it on Mon, was picked up on Tue and delivered to me on Thu. 5 days. That's slow by FlipKart's standards. Stuff that I buy directly from FlipKart usually gets shipped the same day and I get it next day or at max in 2 days.I was also not happy with the packaging. The seller just wrapped the laptop box in a thin layer of bubble wrap! That was a scary sight!OK now the Lenovo IdeaPad Y510PThe laptop looks damn sexy with the red backlit keyboard and trendy looking speakers. I haven’t put speakers to much use yet, but they are way better than my Dell. USB 3.0 is really fast. I can tell the difference when I copy files over on to my WD backup drive.Okay Full HD resolution. This one does have full HD, AND now I know why laptops mostly don’t have higher resolution – the 15 inches screen is just too small for full HD. Things are super tiny, I set the display to 125% and that makes fonts blurry (Mac like) in many applications and images in browsers look funny. Only if I am watching a 1080p movie will the resolution be of any use, but I’d rather watch that movie on my TV rather than laptop! So full HD on laptop is not really worth it.The only problem that I have faced with this laptop is that on the touchpad instead of having buttons for left and right mouse click, it has clickable surface. And it is hard. You have to press is hard as opposed to a gentle press on the buttons of Dell. I mostly use a mouse so it doesn't affect much but without mouse things get a bit difficult. The touch pad also has gestures and other such gimmickry which I did not find very useful. Come on Lenovo it's not a Macbook."
    }, 
    {
        "date": "28 Jun 2014", 
        "star": "5", 
        "description": "For 60k (Although I got this for 54k thanks to Flipkart's credit card payment discount) this laptop is a total beast.It says it has GT 750M but mine has GT 755M, and I have verified that from a lot of testing softwares, so that's a real bonus because 755 gives almost 7-10% higher performance than 750M.One thing I didn't like about the laptop is that I couldn't choose to partition the HDD during the setup although partitioning can be done later on too.It comes with Windows 8 (with a free update to 8.1)The Ultrabay feature is pretty smooth. It lets you remove the DVD Drive and add either an extra HDD or an SLI ready graphic card which makes this laptop a total beast and you can easily run games years after you buy this, using this feature.The red backlit keyboard gives a real slick feel to it. There are 2 intensity adjustment levels for the back lights. (Using Fn + Space)Speakers are better than what you can find on normal laptops. The sound card is really powerful since the headphones totally blast on full volume so that's a real plus for music enthusiasts.It comes with a bit of bloatware which is easy to get rid off.It comes with a FULL HD display so the display is really crisp and awesome.The laptop comes with a ventilation system at the bottom which is a real bonus for gamers since temperatures really sore up.Cooling pad for gaming is a must since temperatures go up to 86 degrees while gaming.Temperature during normal usage is around 40 degrees.Battery life is decent. But assuming that anyone who buys this laptop will be for gaming, battery life really wont matter since you'll need to keep it plugged for that tad bit of extra watts supplied.It comes with 8 gigs of RAM so any kind of operation is pretty smooth.The i5 processor is really good and people going for the higher version of this laptop should really think since the only difference between the two is the processor - i5 and i7 and the price difference is around 17,000.It has 2xUSB 3.0 ports and 1 USB 2.0 Always-on port (You can charge your phone using it even if the laptop is off.)1 HDMI and VGA port.So go ahead and buy this laptop, you won't regret it!"
    }, 
    {
        "date": "02 Jun 2014", 
        "star": "4", 
        "description": "If you've read the other top reviews, you've covered almost all the pros and cons. But all of them fail to point out these major flaws:1.) This has dual graphics. The Nvidia GeForce GT755M 2GB DDR5 (Dedicated) and Intel HD Graphics 4600 (Integrated). Now when you play a game make sure you're using the 755M, because the default settings are set to use Intel. Also Nvidia doesn't allow you to play pirated/downloaded games. For this a fix is given on Lenovo Forums, just google &quot;Lenovo Ideapad Y510P GPU Confusion&quot; and open and read the first link.2.) Win 8: I just hate Win 8. I'm sure most of you do. You can't downgrade it, if you do you'll have to  do it with your own duplicate Win 7 bootable disc, thus ending your warranty. Win 8 will lag most of your Games. Better upgrade to Win 8.1 ASAP.3.) Major Heating Issues: When gaming, your laptop will heat to extreme temperatures in just 15-20 mins of mediocre gaming. You better get a cooling pad, it will atleast reduce the temp by 4-5 degree C. But it will still be extremely hot because most cooling pads take out heat from the bottom while this one emits heat from the left side, so choose a cooling pad with atleast 1500RPM fan speed.4.) Horrible Touchpad: If you're a gamer, well even if you're not you'll have to get a mouse sooner or later. Its not exactly a touchpad, you do press the buttons they are just below the surface. You also cant press both left click and right click at the same time, which is a shame.5.) Last but not the least, you can only enjoy gaming when your charger is plugged in, i.e. on AC power. As soon as you remove the charger your games will start to lag. They will become almost unresponsive. I've contacted Lenovo about it, they say this is just how the machine is. Real Disappointment.So please think before you buy. I knew about all those cons and still bought it (not from flipkart, from elsewhere because it was cheap there) because I was willing to compromise on those things. This machine is the bomb! Best for gaming in the middle range if you don't mind the cons. Best Wishes"
    }
]