[
    {
        "date": "20 Dec 2013", 
        "star": "5", 
        "description": "I got the product from WS retail through Flipkart. I chose &quot;in a day&quot; delivery option, and the product was delivered the next day. The packaging and delivery time were good.Now coming to the Macbook Air. I had been using Windows OS all my life and now was switching to Mac OS.The 1st thing that you will notice when you get this macbook is how thin it is. It looks awesome. After a few hours of use you will be saying to yourself, thank god I switched to Mac, not only for the looks but for the performance as well.Before purchasing the macbook the apprehension that I had was whether I will be able to use MS office the same way that I used to on my windows laptop. In my opinion, after a few days of practice and adjustment you won't find any problems working on excel, word etc.I will list the pros and cons of the macbook Air to help prospective buyersPros: 1. Very slim and good looking laptop.2. Quick boot/wake up time3. Long battery lifeCons: 1. Need some time to adjust to mac os2. Need to carry a hard disk all the time, the internal storage very low."
    }, 
    {
        "date": "04 Feb 2014", 
        "star": "1", 
        "description": "product review :i use to research every product before but now i have kind a become apple fan. because if i start counting pros and cons i always find apple product to have more pros and less cons compared to others products.this is what i looked for : apple macbook air vs lenovo yoga and dell xps 12here is why i went for macbookbuild quality was bestresale value is betterbattery life is exceptionali wanted to use mac once on daily basisi like apple (iphone, ipod, ipad) :)what i liked in xps and lenovo but compromised :touch screenwindows (since i have always been using it)about mac as first user initially i am finding a bit different and i find the text is little blur :D. but i think i would slowly get use to it. as all the reviews i have read say mac is equally powerful and we can do whatever we do in windows in mac as well. so still testing :).this is review i wrote before and gave 5 star. now i am giving it 1 start because after 20 days of usage i realized my choice is wrong. Apple is no more apple.here is why :The review by MonoKaran is right. The screens of macbook air (many) are tinted yellowish when compared to any screen. i contacted apple care they are ready to replace macbook only through the store you bought it and flipkart is not ready. Thus after just 20days the best solution available is to get screen repaired from mac store because they will only repair but not replace because you did not bought from them.macbook air 13 have faulty screens beware. This is manufacturing defect but apple replacement is done only through the reseller you bought it. which is really bad.the issue can be read all over internet &quot;yellowish tinted screen macbook air 13&quot; and search."
    }, 
    {
        "date": "31 Oct 2013", 
        "star": "5", 
        "description": "I am Not a Blind Apple Fan.First Part : Littile Goof Up by Flipkart team but in the end they were prompt and good at solving customer problems (miles to before you sleep Flipkart).Second part the product ;I had a Macbook which was with me since 2008. I absolutely loved it . It got broken so I decided to buy a new Macbook air.I did hell lot of research read about it saw number of videos then once fine day just ordered one.It is one absolute value to the money product .It gives good battery life. Display as usual Vibrant and very good.it is very light . Aluminium body is really good sturdy and strong ( bit problem touching it in Cold seasons :P)I know that hard-disk Size is a bit of issue but external hard drive backup will keep you alert and safe.apple mavericks update makes it more wonderful and more powerful (of course Iwork is also free).there are only two USB ports (I have never used more than that in my windows laptop too any time )good that Apple finally got rid of cumbersome and unnecessary CD drive .People always complain about Apple products being very costly but if you see it in over all package and the small details it is totally  worth it .Other Laptops with more or less same features cost more or less same only (Sony laptops or Samsung high end laptops).so it is really a good buy.I will highly recommend this product to everyone . If you can afford it then it is the best buy in this segment ."
    }, 
    {
        "date": "08 Jan 2014", 
        "star": "3", 
        "description": "Have been a macbook air user for the last 2.5 years. At that time, when I first switched it on  I was floored by the display quality. Assuming every mac would be of same quality, I bought one more (the old one is worn out and I wanted to make it the standby) on flipkart.The first thing I noticed was the there is a light yellow tint in the screen - its just not white even on google's home page. Its like how a white shirt looks after a few years :) The difference was stark when I placed the old mba next to the new one. If I show only screenshots of the two most would mistake the old one for the new one!!There are lots of posts on the net regarding this. Many posts seem to suggest that its the LG manufactured screen that's to blame and Samsung ones are better (or vice versa in other posts). iSheep/fanbois would not blame Apple though its their product and they are the ones to blame here. Tried a few colour profiles that are supposed to solve this problem but none gives me the quality of the old mba. Returning it is not an option for me as I need it for work and from what I read, even the replaced ones are said to have the same problem.That said, the battery life is awesome! I've been using it on battery for the last 3+ hours - watching some youtube videos, downloading stuff and its only down to 60% now. And it just does not heatup like the old one does - so its really a laptop.So, bottomline is if the display quality is not of concern to you (yeah right :-) ), then go for this. All said, it enhances productivity (am a web developer)."
    }, 
    {
        "date": "26 Feb 2014", 
        "star": "5", 
        "description": "I wanted to buy a laptop and started research which went on for about two months.After reading, comparing, about several models and visiting several showrooms.(At point of time I seriously considered Desktop as an option too. I finally narrowed down to few models. Lenovo ideapad yoga, Macbook air, HP pavillion N201tx Lenovo ideapad is also a great product by the way, except for its screen, which is relatively uninspiring.Finally, I struck Ideapad off and was left with MBA and HP Pav. It may seem I was comparing apples to oranges but given my requirements it was fair comparison.I will try to explain how.I am an( 9 to 5) office going person. I like to watch movies, listen music and play some games on my laptop (I am not a hardcore gamer)I went to showroom and checked out both of them.If we forget about specs(Numbers). Play a HD video song on both of them and then you'll know what I am saying.As far as I can remember I have never watched movie with laptop speakers. You simply do not do that. For that I have creative 4.1 which is enough for my room.But, believe me I haven't touched my speakers since I have bought MBA....!!!Now, I am not suggesting that you should buy MBA just coz it sounds good and screen is awesome.I bought mine online by the way as it is cheaper here than showroom.Everyday when you open your MBA, you'll feel 'WOW'. All that shine. All that curves. All that looks plus it takes 10 second to boot and all.Lets get inside. Let me bust some myths.Myth:  You cannot run .exe files on OSX.Reality : You can. There are number of ways which I have mentioned below.Myth:   You cannot play games on MBA.Reality: The truth is, most of us are not hardcore gamers. And most of the games play smooth on MBA, you can check videos of people testing MBAs on games on youtube.Also, you can easily install windows and run your required applications.Now somebody will ask me, &quot;What you said is good, but is it BETTER than Windows?'To this I would say, what is the diff in Hero CBZ 150cc and Honda CBR 150cc. Same engine but price is almost double?And moreover after checking windows 8.1. I felt that windows is still trying to copy OSX.I will not rant about great trackpad, or that garage band or how good its webcam is etc etc.If you find yourself asking this question, &quot; Is it worth spending extra bucks?&quot;The answer is , &quot;Yes, most definitely it is&quot;Lastly, as you may know it has fourth gen haswell processor.Put all the specs, i.e. i5 4th gen. 4 gb ram, screen size, resolution etc on flipkart and you'll be surprised by the results.Hope this helps...P.S. for installing windows, you can use bootcamp apllication on Mac or you can download virtualbox. Also if you want to run windows programs without installing windows, please google winebottler.I haven't installed it yet as I have my exam on 1st. I'll update after that.Update: Wine, and Wine bottler installed. Running MS office 2007, and games such as Need for speed most wanted, Call of duty, without any problem."
    }, 
    {
        "date": "25 Jun 2014", 
        "star": "1", 
        "description": "this product has been upgraded in market and is available at 10000/- discount on student id. the seller is rude and offensive and doesn't listen to you. niether does flipkart support a customer over the seller. once the thing is shipped it's your headache- there is no after sales support etc. you are at sea. flipkart is fine as long as everything foes fine and you are LUCKY. if something goes wrong- you had it. i bought a nexus phone- its charger heated up the phone and burnt my outlet. i bought a cover for nexus it came damaged and used. no help no support. and i must have given business to the tune of a couple of lacs to flipkart. and this is the support i get from them. my honeymoon with online shopping is over. remember- if you are buying any high ticket items- buy it from the store where you will be sucked up to and given hefty discounts and after sales service. they even give you working copies of software which costs 25000 bucks in the market. till date i havent got the warranty or invoice of this order."
    }, 
    {
        "date": "15 Mar 2014", 
        "star": "5", 
        "description": "I always prefer to buy from W S Retail. Prompt and reliable and great packaging. It had In-a-day delivery option which was free with this computer. It was indeed delivered promptly with in 24 hours. The best part,  it was almost 12K cheaper than the best price offered to me at Imagine Store(Apple authorised reseller).Though in the specs on the site they mention that it has Mountain Lion, the computer comes loaded with the latest Mavericks! That was a pleasant surprise. Also, I was thinking that since they are offering at this price it must have manufactured long time back, but mine had a manufacturing date of Dec, 2013. Another pleasant surprise!Overall, it was great experience to shop at Flipkart.About the computer, I opted for Air over Pro since I felt I really do not need that powerful a computer. So, I decided to not get tempted to buy something which is most up-to-date and powerful. As far as storage, though 256 GB would have been better it was almost 18K more compared to this one and you can buy 1 TB drive for 4K. So, opted for 128 GB instead. I hope I wouldn't regret this decision later."
    }, 
    {
        "date": "02 Apr 2014", 
        "star": "5", 
        "description": "This is why people love Apple. Perfection. In everything they do. And that little price tag is not for quality or name. It is for the perfection they have achieved.It has the perfect display, perfect weight, perfect speed. I just can't get over the fact that I was missing this awesome product all this while.Did a lot of research and this is where my search for that perfect laptop ends.Screw Dell and HP, trashy hardware, cheap components and anonymous service centers around the country are the main reasons I would never buy any of that again.If you still want to invest your hard earned money in those good-for-nothing trash, do it at your own peril. But it's a long march for them to even come close to Mac and Apple.Just to give you a glimpse of what lies behind this awesome product, ask yourself this:How long does it take for me to connect my printer to my PC on a Windows machine?The answer is not less than 10 minutes at best?Well, on my MacBook Air, it connected in less than 30 seconds, and I had my printout in my hand in less than a minute.Take that Microsoft.Apple is simple. Apple IS perfect.Thanks again Flipkart for this awesome product."
    }, 
    {
        "date": "22 Mar 2014", 
        "star": "5", 
        "description": "Faster delivery from flipkart side. I chose one day delivery, and got it delivered in just 24 hours. Great packaging from flipkart side as well as from Apple side -- MacBook Box. It is pretty slick product. Very light weight. Good battery life. Before buying, i always got very good review about battery life ( saying it can last upto 12 hrs, but i didn't believe that ) , but when i bought , i got to know, that, it can give you more than 12 hrs battery life (13 - 14 hrs), depending on your usage. If you browse internet and play mp3s simultaneously, it may give you 7-9 hrs or more battery life approx.Before buying this, i always searched , whether it is worth buying MacBook and i always get results saying, those who bought , they say yes, rest no. But let me tell you, it is worth it, every penny you invested, give you its value. SSD is pretty fast. Performance wise, it is good , after using 4-5 hrs, heat generated is still mild. Backlit keyboard and automatic light sensing is very awesome. Last one thing, flaw/thing you may miss is -- DVD drive, Lan port, but if you compare this with MacBook pro 2013 edition, that lappy even don't have those thing. Since, mostly i use wifi, i don't need this, and you can get external dvd and usb-to-lan.  So go ahead and buy brand new MacBook Air."
    }, 
    {
        "date": "08 Apr 2014", 
        "star": "5", 
        "description": "This ultra book is the best I've ever owned - The keys are spaced correctly to distinguish one key from another. The interface is flawless. The spacious trackpad is just mind-blowing. It came pre-installed with OS X Mavericks, iWork and iLife. Pre-installed software took up a mere 20 GB, leaving me with 98G GB for my work. The aluminium unibody gets scratched easily. A grain of sand can easily make a scratch as wide as a needle. The glowing Apple logo, behind the screen doesn't consume any power at all, as it is lit by the backlight of the LED screen. The battery life is just amazing. I charged it for just 3 hrs and it lasted 10 hours and counting. (I am writing from my MacBook Air) I bought the Mac from TheLapStore, the seller was very prompt in shipping and the product came in a triple-layered bubble wrap. Apple has done an amazing job on this Mac notebook. The Intel Haswell processor is fast and doesn't consume much power. The notebook rarely heats up, even if it does, It is just a mild warmth. I would reccomend it to High School student like my self for typing documents and creating presentations."
    }
]