[
    {
        "date": "27 Jun 2014", 
        "star": "3", 
        "description": "Good product and nice deal as well, i bought it on 25th june..from the first day itself wifi problem is there after some time it will show limited access, again i have to stop and start the wifi connect.battery is acting wierd, at 99% it will show 3 hr 30 mins and 67 % it is showing 4hr 15min sometimes 5hr 32 mins.cant understand the strategy of battery.apart from this two problem performance everything is fine and i got it for 34000sound is awesome, display is good"
    }, 
    {
        "date": "19 Feb 2014", 
        "star": "5", 
        "description": "At this price, this is the only laptop giving you NVIDIA 740M.Any gamer knows the capability of this machine just from that.Anyone who is not a gamer, honestly, is better off buying a machine with a higher clocked processor with Intel HD Graphics 4000."
    }, 
    {
        "date": "23 Jun 2014", 
        "star": "5", 
        "description": "Totally satisfied with the performance of the laptop.The graphics is awesome. And no challenge for music quality from Sony!!!!Looking at the price, it's really good product from Sony.The Flipkart delivery service was the most quickest of all the orders so far....Got this laptop only within 8 hours from order placed!!!!"
    }, 
    {
        "date": "23 Jun 2014", 
        "star": "1", 
        "description": "This laptop does not have good ventilation and as a results it gets heated and the wifi card stops working. Search wireless problem in vaio fit on google and you will know."
    }, 
    {
        "date": "24 Jan 2014", 
        "star": "3", 
        "description": "Good sound and graphics and better battery backup. But HP Pavilion 15-E016TX offers better options than this especially in terms of HDD capacity and intel processor.( 1TB/ i5 3rd gen)."
    }, 
    {
        "date": "16 Oct 2013", 
        "star": "4", 
        "description": "With the festive season going around , this Sony VAIO laptop shows good features. This has some great features. But there is a SALE on PANASONIC products also., Do check it !!!!!!!"
    }, 
    {
        "date": "24 Nov 2013", 
        "star": "4", 
        "description": "its very good but touchpad not working properly::::::and all other featurs are good. so i give 4 star out of 5"
    }, 
    {
        "date": "18 Oct 2013", 
        "star": "1", 
        "description": "this product was worth 39990 in june july , then increase to40990 in septmeber , finally its price has been raised to current price , wow sony shows the way , better to go to other laptops recently have launched 4 gen intelat much lower price.sony the great"
    }
]