[
    {
        "date": "18 May 2014", 
        "star": "3", 
        "description": "I bought these shoes for my dad. Delivery was quick(as usual).It looks great....quite light too.After a few days of use my dad had a striking pain in the heel. After some time it subsided. The shoes are not very comfy from inside.For light walker and joggers its a Go!"
    }, 
    {
        "date": "21 Apr 2014", 
        "star": "5", 
        "description": "best for brand of addidas and purchas when price down about1439 when i buy it.And this product quality is satisfactoy not very brillent  so if all brothes buy this item then price is acceptable 1500rs. so keep pations and wait for price drop."
    }, 
    {
        "date": "26 Feb 2014", 
        "star": "5", 
        "description": "I am using this product purchased from flipkart. Flipkart service is very good and with best in market price. Also this shoe is very comfortable for me. I am fully satisfied with both. the Shoe and Flipkart services."
    }, 
    {
        "date": "17 Feb 2014", 
        "star": "4", 
        "description": "well, it is just as shown in the display, have a premium quality, fits in well and seems durable enough (at least upto now ! ). Have used it for 15odd days...no problem so far :)"
    }, 
    {
        "date": "21 Jan 2014", 
        "star": "5", 
        "description": "i recently used this shoes.Product is very good and comfortable. flipkart service is very good.it is good product at reasonable price as compared to other sports shoes."
    }, 
    {
        "date": "13 Jan 2014", 
        "star": "5", 
        "description": "Totally loving this. It was a good decision and would recommend others as well. Thanks to Flipkart for bringing this product. And very prompt delivery as well !"
    }, 
    {
        "date": "03 Jan 2014", 
        "star": "2", 
        "description": "It is decent for this price range for a branded item. The white gets dirty quickly though. The feel also looks a bit cheap as if it wasn't really Adidas. But go ahead if you need a cheap running shoe"
    }, 
    {
        "date": "08 Jan 2014", 
        "star": "5", 
        "description": "i am recently used this shoes , product is very good.flipcart service is very good.it is good product at resanabal price as compared to other sports shoes.."
    }, 
    {
        "date": "15 Apr 2014", 
        "star": "5", 
        "description": "Good Shoes.. Flipkart good at their service.. The product is good and Good shoes to go with if you are looking for something within 2000. Comfortable.."
    }, 
    {
        "date": "02 Feb 2014", 
        "star": "3", 
        "description": "Bought first time adidas brand new shoe from flipkart at a afforadable price. experience is nice . These shoe are comfortable and light nice looking"
    }
]