[
    {
        "date": "26 Oct 2013", 
        "star": "5", 
        "description": "Ordered the black Transform lV from Flipkart and received it in 3 working days. Flipkart has taken extra care with respect to packaging of the shoes by adding an additional exterior hard-to-feel packing in order to reinforce the original packaging provided by Nike. The product was absolutely untouched and in a completely packed state when I received it. So full marks to Flipkart as far their logistical role was concerned.Coming back to the shoes, well I had been using Adidas for last 5-6 years, and the feeling so far after shifting onto Nike has been good. With a real ruthless use my previous Adidas lasted for 2.5 years and I was completed satisfied with it. I hope it would be the same with the Nike Transform that I had recently bought from Fipkart.P.S. - I also got 25% discount on this product, which made my buying experience even more fruitful."
    }, 
    {
        "date": "06 May 2014", 
        "star": "5", 
        "description": "Flipkart, as usual, amazingly fast delivery. how do you guys do that?Now the product. The shoes are very comfortable, it has Textured Sole, Padded Footbed, Cushioned Ankle.. blah! blah! The thing is these shoes encouraged me to get up at 5am and go for a jog after a long time. And boy, i ran that day. And i ran so hard... the results were: a bruised finger, pain in calf muscle, dehydration.But the good news is, these shoes are still encouraging me to run, and...I...WILL...DO...IT...AGAIN (soon).- I approve this message."
    }, 
    {
        "date": "02 Oct 2013", 
        "star": "5", 
        "description": "These Shoes Are Superb...I bought them from the official showroom....They are very comfortable......My legs dont get sweaty in these shoes..................................Best FOR RUNNINGI like dem a lot!!!!!!dey are so kool!!!!!!awsum!!!!!!!!!!!!"
    }, 
    {
        "date": "26 Apr 2014", 
        "star": "5", 
        "description": "This is a decent piece of footgear for ur daily walks and jogging with the cushioning giving the right amount of comfort to the heels and ankle. Highly recommended for casual runners and first time joggers.Please note the size to be one up from the normal ones you would buy. i normally use a size 9, but this one was tight and so had to select size 10 after asking for a change."
    }, 
    {
        "date": "23 Dec 2013", 
        "star": "5", 
        "description": "Flipkart delivery is awesome....I got the the shoes in 2 working days.... Very speed delivery...Regarding shoes... Nice Product....very comfortable....good looks. and moreover it is NIKE.... no one can comment on NIKE shoes...Nice experience with flipkart...hope to buy more products in flipkart...."
    }, 
    {
        "date": "15 Mar 2014", 
        "star": "4", 
        "description": "Shoes are very comfortable inside. while running it's sole absorbs most of the shocks. I like it's black color. Design is perfect and attractive. Multiple color choices are available. As it's sole designed in such way that it help to land your feet in correct way while running and  so chances that you will pick ankle twist are rare."
    }, 
    {
        "date": "30 Apr 2014", 
        "star": "5", 
        "description": "Ordered on Apr 29th with in-a-day delivery and received the product on Apr 30. Excellent service by Flipkart. The shoes are as advertised and are quite comfortable based on initial trial. As mentioned in the product description and also by other reviewers, I ordered one size greater than what I normally wear and found this to be very comfortable."
    }, 
    {
        "date": "06 Feb 2014", 
        "star": "5", 
        "description": "I used this Nike shoes from second last month of 2013. A three months experience with this shoes i have.. It's really very nice shoes, comfort and looks both are excellent. I love this Nike shoes. And of course a fast delivery by flipkart. You gonna love it."
    }, 
    {
        "date": "09 May 2014", 
        "star": "1", 
        "description": "Delivery: Quick and smooth. Properly packaged.Product:1) Cheap build2) High sole3) unimpressive looks4) difficult to run in..Better spend a bit more and buy a better product. Though this product is cheaper, it is nowhere compared to the nike standards"
    }, 
    {
        "date": "30 Apr 2014", 
        "star": "5", 
        "description": "i got this shoe for 1750 rupees and i feel really comfortable i would suggest this shoe to people who are looking for good quality and cheap shoes.i was not happy with the delivery by flipkart. it took 20 days to deliver"
    }
]