[
    {
        "date": "30 Jan 2014", 
        "star": "5", 
        "description": "Bought a pair of Puma Shoes under the &quot;upto 30% discount offer&quot; running in January-2014.  Product Quality with respect to the product pricing is simply unmatched and which I believe can only be offered by Flipkart. Product was delivered before the promised delivery date in a neatly packed Flipkart carton adding a second layer of protection in addition to the Puma shoe carton . Extremely happy with the delivered product !"
    }, 
    {
        "date": "27 Apr 2014", 
        "star": "1", 
        "description": "first time u wear it u don/t realize that therez a defect in the shoes. but after wearing it for 2-3 times for a long time u realize about the defect. my left shoe is giving me shoe bite on the li'l finger. i checked that there is some weaving defect in the shoe and a protective pad or cover is not present over the li'l finger. after wearing it 2-3 times u r not able to return it. so guyz don't buy these shoes"
    }, 
    {
        "date": "23 Jan 2014", 
        "star": "5", 
        "description": "I have been ordering from flipkart since a while now and I have never faced any problem in any of my online shoppings till now. flipkart delivery is awesome and the quality of the product they deliver is genuine.these puma shoes are really awesome not only in a look but also in comfort. they are feminine,elegent and comfortable! love flipkart! love puma!"
    }, 
    {
        "date": "04 Nov 2013", 
        "star": "5", 
        "description": "Promptly delivered in a day. Of course, there are couple of other items which are awaited.Good Looks.Comfortable fit.Light weight.May be a little stiffer. But should not matter for general purpose running, playing and dancing.Overall- Value for money. Thanks to the Deal of Flipkart."
    }, 
    {
        "date": "08 Jun 2014", 
        "star": "4", 
        "description": "very nice product and above all services of Flip cart, light and clours are good, worth of money, very happy to purchase the product. The services are always at the best. Timely delivery and nicely packed. wish to continue the same with flip cart ................................................................"
    }, 
    {
        "date": "22 Mar 2014", 
        "star": "5", 
        "description": "Got these shoes well before stated delivery time. They come with great packaging for extra protection. The Shoes are very light and rugged for regular use. Geat Quality product. Fully satisfire with the experience"
    }, 
    {
        "date": "07 Jun 2014", 
        "star": "4", 
        "description": "Definitely worth the price. It makes your feet feel safe and secure and is really comfortable!I use it mainly for jogging and it has been, in my opinion, a great choice for the price!Those who are confused about it, don't be- just go for it."
    }, 
    {
        "date": "04 Feb 2014", 
        "star": "5", 
        "description": "Its a very good product. On other sites the product is available at the original cost but on Flipkart I got very good discount.Product quality is really good.light weight, good sole and comfortable.."
    }, 
    {
        "date": "27 Apr 2014", 
        "star": "4", 
        "description": "I  am a regular visitor of Flipkart.com,but was a bit hesitant about buying shoes due to size issues etc. But I was wrong :) The shoes are really comfortable and worth their price . The product was delivered on time."
    }, 
    {
        "date": "30 May 2014", 
        "star": "4", 
        "description": "Light weight shoes..However I noticed that sometimes it creates a pinching effect on toe (which is lil painful).. though not sure if its shoes or work-out :P Slightly slippery on wooden floor."
    }
]