[
    {
        "date": "23 Mar 2014", 
        "star": "4", 
        "description": "You usually need a pair of sports shoes for your casual trips &amp; the primary considerations are comfort, near weightlessness &amp; some style.This is my third Reebok pair &amp; on all these parameters, Reebok always lives out to expectations without pinching the pocket like an Adidas or a Nike. An additional bonus was the surprise additional discount Flipkart offered me when I was ready to pay out, bringing down the price further to sub INR 1800. That was the real icing on the cake for me in the transaction."
    }, 
    {
        "date": "21 May 2014", 
        "star": "5", 
        "description": "Hi, i like this product after wearing when i go with friends everyone is saying very nice shoes so what else u needed,it reebok so its comfortable no doubt on it.thanks for quick delivery flipkart."
    }, 
    {
        "date": "11 Apr 2014", 
        "star": "4", 
        "description": "Light weighted shoes good looks and comfortable to wear.good for running and walkingDelivery was OK could have been better"
    }, 
    {
        "date": "19 Jun 2014", 
        "star": "5", 
        "description": "the shoes are light weight and comfortable.good for running and jogging .very attractive.the delivery of shoes was good  delivered withing 3 days ."
    }, 
    {
        "date": "11 May 2014", 
        "star": "5", 
        "description": "very lite weighted shoes good for sports as well casual wear..also satisfied with the delivery service delivered in 3 days"
    }, 
    {
        "date": "19 Jun 2014", 
        "star": "5", 
        "description": "A perfectly fine shoe. Equivalent to another shoe worth 3-4 thousands. Its gonna easily last for more than a year."
    }, 
    {
        "date": "04 Jun 2014", 
        "star": "4", 
        "description": "Very light on pocket and light by weight .Easy to walk at speeds and soft soul comfort to go for distance walks"
    }, 
    {
        "date": "22 Jun 2014", 
        "star": "5", 
        "description": "My friend got this. There was an offer going on and we grabbed it. Totally worth the money. Looked great."
    }
]