[
    {
        "date": "12 Jan 2014", 
        "star": "2", 
        "description": "The experience of shopping with Flipkart was good. However, it is a pain to process returns and refunds if you buy apple products.The iPhone 5S i bought has a rattling power-on/wake-up button. On calling flipkart i was asked to go to an apple store and get it checked and get a job sheet certifying that there is some real problem with the phone in order for Flipkart to replace/refund it.So, i did that, and now Flipkart wants a scan copy of it and will check with apple. God know what these people are upto."
    }, 
    {
        "date": "31 Oct 2013", 
        "star": "4", 
        "description": "Build Quality: Unmatched (The closest competitor would be the HTC One)Display: Many people complain that this 4-inch retina display offering is joke when compared to what other manufacturers offer these days. But this is not a phablet; it's comparatively much easier to use with one hand and the color tone of the 5S is much better than the overly saturated displays on the Galaxy S4 and Galaxy Note 3.Processor and RAM: The 5S has only 1GB RAM and a Dual Core processor which seemingly pales in comparison to what other flagship phones have to offer. But if you are a serious buyer, don't be fooled by these specs because the iPhone 5S is actually &quot;The Fastest Phone ever tested&quot; till date. The reason why the iPhone 5S blows away the competition is because it's processor is made specifically for the phone and it utilizes and squeezes processing power in the most efficient way unlike other phones whose processors are generic and used across various manufacturers without really utilizing available power to it's full extent.Camera: The 5S has a excellent camera but it is not the best in the market.Call Quality: Normal calls are just as good as any other phone. But not many people are aware of the new facetime audio HD calling feature across iOS 7 users, the clarity is almost too much! You can even hear a person swallow or smack his/her lips. Little too intimate if you ask me :-)Special Feature: Fingerprint Scan and unlock your phone. People may argue over the pros and cons of such a feature but I would personally prefer such a feature which I will certainly make use of; instead of an almost useless fancy feature which I rarely use. (Eg: Touch to share)Price: Considering that the manufacturing cost of the iPhone 5S is just one dollar more than that of the iPhone 5 whose manufacturing cost is around INR 13,000; I would have liked the 5S to be priced at 40,000. It is without doubt EXPENSIVE!"
    }, 
    {
        "date": "03 Apr 2014", 
        "star": "1", 
        "description": "I just read this review, it is of that certified buyer.Have you (flipkart) done something about this... if not, then I am afraid that this may happen to me, if i purchase a mobile phone from your store.Even if you go to apple store, they don't hand you a new phone, they hand you a re-furbished phone.This buyer obviously had a very bad experience with you and WS retail, who has a tie up with you.So my question is, What actions have you taken with regard to this complaint?P.S. 500+ ppl found the below review useful, you may have lost that many customers!!!!! I hope you realise the gravity of your situation.http://www.flipkart.com/reviews/RV5P5LYEGKVURZVMS"
    }, 
    {
        "date": "01 Nov 2013", 
        "star": "5", 
        "description": "Well the iPhone 5S is here ! its the best iPhone today ! but is it up to the mark ? Well Yes !Short Review :-Build quality !The iPhone 5S comes with the same look and feel as the last years iPhone . The screen is the same Although there is a fingerprint scanner in the front now ! also knows as touch ID !Camera:- The camera has been bumped Amazingly ! Although 8mp like the last year ! the iPhone 5s now has a larger sensor and aperture tat it captures stunning pictures ! And the dual coloured led flash makes Photos look even More dramatic !Speed:- Amazingly Powerfull ! Many people look at the specs and decide which phone is fast but tat is utterly wrong! The iPhone 5s Beats the galaxy S4 and the xperia Z1 in terms of processing andf graphic speed ! Test dreived by benchmarking apps like *Geekbench3**Antutu*3D max*Verdict !Yhe iPhone is definitely amazing with its 64 bit A7 processor Along with the M7 co-processor ! The better camera And the touch IDWell how does so much come from a phone tats just 112 gms and so damn Sleek ? Well tats Apple :)"
    }, 
    {
        "date": "23 Nov 2013", 
        "star": "4", 
        "description": "There is something a prospective buyer should understand before even looking to buy an iphone 5s.I'm no apple fanboy, trust me, but it IS the best phone available on market right now.Not the most value for money, but the ultimate best. The Primera.Looks wise, I'd say its not a bad job. The same signature look that it has carried on since long. The gold and gray look fantastic, and feels nice in hand as well. But looks aren't even the intro to the whole story.The A7 chip inside is the best processor available on market for mobile devices, even better than the top of the line SnapDragon 800 which is the best any android/windows phone can offer.The performance gains are not significant enough to matter to a casual user, or any user unless you were really looking for it. Its like saying ones a lockhead blackbird and others a falcon htv2. FYI, they're both insanely fast aircrafts. For people like us, its insignificant which is really faster. The 64bit architecture wouldnt matter much to the normal user as long as the applications dont make use of it. Its just apple being paranoid as usual about being future proof.In addition to the processor capabilities, a major plus of Apple devices is that iOS7 was optimized for A7, while android(kitkat or jbean or whatever) is not. Android runs on a vm which leeches out a bit of the potency.The GPU performance is commendable, and the motion processor m7 is also a unique characteristic, though if its full potential can be used in normal scenario remains to be seen. Yet.The fingerprint scanner is a new innovation, and seems to work pretty good unless your hands are too sweaty. Currently its use is limited though in time in-app authentication as well as credit card/bank acc/wallet authentication could also be done using it. Lots to look forward to.Downsides are also there, iOS7 needs more optimization to be better. And some might prefer a bigger screen to utilize all that juice inside. Though IMO the size seems optimum, not too big for a phone, and not too small to be disappointed. The battery could be a bit improved too, to last more than a day. A7/M7/PowerVR6 does drink a lot of power.All in all, I5s is not your casual whip-it-out-of-the-pocket-and-throw-it-to-the-bed smartphone, its a carefully constructed marvel. Powerful, future proof upto maybe 2+years, which is not something any other phone can boast about. Only two things stand in the way of it being the optimum phone, 1st being on the higher side of the food chain, and 2nd the more important one, we dont need that much power or performance. Yet. The app ecosystem, however large and varied it is, still doesnt have any applications that make use of the a7/m7 processors inside, or the 64bit architecture for that matter. And without it, its just a lamborghini on indian roads. Still, It IS the most expensive phone on the market. And again, it IS better than any, and you don't get to be the best without beating the best, and it costs to do that, like, a LOT."
    }, 
    {
        "date": "21 Feb 2014", 
        "star": "4", 
        "description": "Hi Flipkart.I had a while/silver iPhone 5S before this which I sold last month and got this space grey one and intend to keep the same till iPhone 6 is back in all awe &amp; glory. I always liked how uniform the screen looked when the phone is switched off and lying beside me when I'm busy with some actual work, far from any distraction due to contrasting white and black.The one piece I received had two issues and it prompted me to return-1) Two tiny black spots were visible against a white background in apps like &quot;notes&quot;; possibly some dust particles had found their way into the screen2) The phone's aluminium frame was bent, starting from the (-) volume button and upwards. It literally threw me off and I was damn pissed. It is also bizarre how it left the assembly line and the final check!!Anyway, the Flipkart guys were very helpful, I got a call back the same day and they did arrange the replacement. In two days I got a new one free of defects. I hope Apple does improve its in-process quality control.I was this close in snapping buying electronics from Flipkart; but their through professionalism in addressing the issue and making good of the problem surely speaks of their character. Tell you what, I will stick to them.Thanks guys.About the phone, you know it, I know it; it's the best out there...Cheers,Jagannath."
    }, 
    {
        "date": "15 Dec 2013", 
        "star": "5", 
        "description": "Dear all,I have purchase this phone from apple reseller due to non availability on flipkart earlier. Anyway I had waited for 7 days after booking and I got this phone last week of November. I am using phone right from Nokia 3310 to Nokia 6800, Nokia n91, iphone 3G, Motorola z10, galaxy note1 and now finally iphone 5s. and believe me apple service, app ecosystem, software optimization for the apps, speed and ownership experience is matchless. All of the above mentioned phone now scraped and found space in my store room. The only phone I am still using is iphone 3G as a second phone. And believe me it is still fast from other phone present in the market. iphone 3G still with me since July 2006 and still working very good. That's why after long research I feel iPhones are really good to have.Useful life of my earlier phone are as follows:1. 3310- 3 years2. 6800- 1.5 years3. N91- 1.5 yrs4. iphone 3G- 7.5 years still with me5. Galaxy note-1 - 1.5 years6.motorola z30- 1.25 yearsHence buy costly apple product for long useful life or buy other phones 2-3 times for the same period.My revie on iphone 5s1. App ecosystem very good2. Ultra fast - 10 times faster than galaxy note 1 which died 5 days back only.3. Screen quality very good.4. No lagging of internet and any app.5. Camera very good.6. Comfort with one hand operation.7. iO7 very good8. Touch I'd work like charm9. Wifi hot spot good10. Call quality good.11. Speaker very very good12. Battery life approx 9-10 hrs on moderate use13. Battery charging time 2 hrs only, from 0-100%14. Integration with other phones is a problem. It requires wifi, FTP or Cloud system for file transfer between phones or tablet. For some users it may bit irritating. But for security and virus reasons it is good.15. It is costly, but when you compare with usefull life with others platform then it is really good.16. Overall design nice.17. Screen size may be too Small for some users. But I feel good after coming from 5.3 in galxy note 1.What I feel very bad about galaxy or other android phones that their software update uncertainty and after update it lags a lot. Additionally it's price drop 10% every 2 months. Galaxy s_3 was launched with 42k and now it is available in 18k. This is not in case of apple. I bought galxy note1 for 39k inJuly 2012 and it was available in 25 k in February 2013."
    }, 
    {
        "date": "12 Dec 2013", 
        "star": "5", 
        "description": "Please read this review carefully before you go for purchase, Please don't buy this product if you're not one of those people who love their phone!!This phone is the BEST phone ever and is made for a premium group of customers who love their phone and respect the legacy of APPLE!!!People who have ever used apple they never buy anything else, for them Samsung, Nexus, Lava, Lemon, spice all belong to a same category!!We will buy this product even if its costs 75-100k coz it cannot be compared with cheap Korean plastic products. So please don't compare it with the prices of Samsung or Nexus!! You can never compare a dell laptop which costs 25k with Mac pro which costs 80k.You will surely see below comments of stupids who have compared it with Samsung or Nexus!! I held Samsung Note 3 in my hand and it felt like shit in front of this. This is phone is fastest phone ever and surely has the best camera I have ever seen (can be compared to my Cannon SLR). Best part is the finger print touch pad!! Only Apply can bring this innovation!!Must buy!!!!"
    }, 
    {
        "date": "17 Dec 2013", 
        "star": "5", 
        "description": "Apple Rocks!!! And iPhone 5s has proven this fact once again!!!!Amazingly Fast...Touch ID gr8...Fantastic Display...Superb touch...Good Camera...The Gold looks gr8...Just download gr8 apps and keep rocking...Add some Midas touch to ur lives... Get one 2day... Thanks..."
    }, 
    {
        "date": "02 Apr 2014", 
        "star": "1", 
        "description": "Hands free is duplicate, and the apple people are saying they are not responsible and they will not change."
    }
]