[
    {
        "date": "07 Feb 2014", 
        "star": "5", 
        "description": "Well, I somehow managed to order the 16gig in the after noon as soon as i saw it available on launch day, 6th feb and it was an awesome feeling..Fools are those who are scolding Flip and rating the product 1, coz they were thinking whether to order it or not while others grabbed it in first look.Now, about the phone this phone is really superb as much as I know I researched a lot about it coz i want value for my money. I will be writing a full review after using it (delivery date is 10th feb)I was looking for the phone that will suit my needed specifications. for more than 2 months I was looking and wasn't satisfied with any of the phone in the market. good phones are too costly and I was unable to decide which phone to chooseWhat i needed -1.A tough rugged phone. I am careless I usually carry keys in pocket with phone and scratches makes me feel that my phone is getting old2. good battery life. I am tired of charging my old phone 2-3 times a day3. fast processor I am not that much into mobile gaming coz I prefer my PC for gaming purpose still I need a good response when I order my phone to open an app it should do it in blink of eye else its dead mister.4.I also needed a good display and good sound quality I love music and a little show off among friends,5 a camera good enough for casual use mostly for instagram and facebook.What I am getting is -1. Corning gorilla 3 protection which is scratch proof even if you try to scratch it with keys2. water resistant (oops I accidentally put my phone with my clothes to wash good lord its alive).3. snapdragon 400 1.2 gh (I saw reviews on youtube and its almost as fast as nexus 4 that is 25k sometimes it was faster than samsung s4 )4.display is awesome 326pixels per inch on a 4.5 inch screen and that on an apple iphone 4s its 329ppi on a 4 inch screen Impressive!!! moto g5.According to one of the reviews in youtube the call clarity in other phones is better but the noise cancellation in moto g is better so I guess it is for me coz i mostly work in noisy surrounding.6. the camera is not the best but in good light it will give you decent images with bright colors and it records 720p hd so nothing to question.7. customizable colored covers which will never let you feel bored the color options are really good bright and lively8.Dual sim - avail the best std and local offers by two service providers9. the phone gives 50 gb google drive space for 2 years10 the phone is usb otis compatible you can connect a 32 gb pendrive if extra space is needed(although i dont need it I already spent 50k on my laptop and 5k on an external drive for storage. 13 gig that is available  is decent for me  )I think in India we are getting charger and headphones i hope sowhat I didn't get1. NFC(near field communication) only yesterday i came to know what nfc means and believe me you are not going to use it even if you get it so dont waste ur hard earned money unless ur dad is having an audi or a mercedes.2.expandable memory (boy that really feels but grrr why didnt they just add an expandable slot -_-3.A 5.5 inch screen well, I am buying a phone not a tabrest everything is there as far as my requirements are concernedAs a whole I found what I was searching for 2 months and at a price less than what my budget, actually I was looking for a phone in the range 15-16k and I got this one in 14k so high cheer and Rs1000 for beer.... :)Although I have tried to be honest in this review but its not justified till i use it...waiting eagerly"
    }, 
    {
        "date": "05 Feb 2014", 
        "star": "5", 
        "description": "Beware Samsung , moto is here. This phone is way better than even above 20000 samsung galaxy shits. It feels super smooth. Absolutely no lag in anything. Gaming performance is also very good. Do note that all this it does in 1GB RAM , so this means that blind hardware specs have no meaning on performance.From the physical build point of view it feels rock solid. You can actually search up youtube videos on its drop test. This is also liquid resistant , so if you accidentally drop it in water it will just work. There's also one video in youtube where its dropped for 30 minutes and it still works. Really crazy!!Bottom line is this is the highest ended phone among the low end spec phones and it raises the bar quite high. So just go for it."
    }, 
    {
        "date": "06 Feb 2014", 
        "star": "5", 
        "description": "I have this phone using from 2 weeks, its the best phone and great value for moneyGot kitkat update immediatelyJust zero lag, played subway surfers and temple run its just smooth.Signal strength is excellent16GB version has 12.92GB available for user500MB (total 900MB) available for user after all appsScreen resolution is excellentCamera - Images and videos are good, I will never use mobile as &quot;digital still camera&quot;Cool Motorola appsBoth Speakers, external and for call are goodBattery lasts for more than 24hrs with moderate call usage and 2G on for 8hrs and wifi rest of the dayI would strongly recommend, Happy to be back to Motorola - my first mobile phone"
    }, 
    {
        "date": "23 Apr 2014", 
        "star": "5", 
        "description": "Its a cheap,cheerful and reliable phone.With such low price one wonders there must be something wrong with it but there isn't. Now every phone has some pros and cons but in this case the cons are very few.First i will talk about the enormous pros.DesignThe design of moto g is the replica of moto x.Its a tough phone with a good handy size and the back of the phone is a rubber like plastic with a dimple of motorola logo which makes it very comfortable to hold it.It also has a water repellent nano-coating .This doesn't make it water proof, but at least makes it more resistant to the odd spill/splash.ScreenOne of the biggest highlights of the Moto G is its 4.5-inch 720p HD IPS LCD, which works out to a density of 329 pixels per inch i.e sharper than Apple's iPhone 5s, which offers 326ppi.It has also used Corning Gorilla Glass 3 on the Moto G to protect it from scratches which is usually found on premium devices priced at Rs. 30,000 and above.CameraIt delivers pretty decent clicks with a 5 mp rear and 1.3 mp front camera with led flash and HD recording.It has a unique feature of slow motion video recording also with other features HDR and panorama.Processor &amp; PerformanceThe Moto G is powered by 1.2GHz quad-core Qualcomm Snapdragon 400 processor with Adreno 305 graphics and 1GB of RAM onboard.The performance is great.It doesn't slows down even with 4-5 background applications running.Even when playing a heavy graphics game like Asphalt-8:Airborne it runs very smoothly.And when i performed a benchmark test by AnTuTu it recorded a score of 11,874 which is pretty close to big phones nexus 4 and Galaxy S III.SoftwareOne of the best features of moto g is that it has the lastest android version i.e 4.4 KitKat and that too with a stock android,stock edition users get the latest versions of Android OS immediately they are out, while customized users have to wait months – and sometimes a year (Ahem! Sony.. cough!) to get updates to their device.Battery LifeThe 2070 mAh seems low but actually it isn't in the case of moto g.The battery life of moto g is pretty decent.With a normal usage it lasted about a day and with heavy usage like playing games,movies with wifi/3g enabled the whole time and calling for 2-3 hours it lasted for about 12-13 hours,which was not bad.ConsThe only downside of moto g is that there is no NFC.Although NFC is a pretty cool tech but think about it even if it had would you use it.VerdictAt this price point, no other phones offer an experience that is as good, so in that sense the Moto G is a game changer.I bought it and i definetly recommend you to get it."
    }, 
    {
        "date": "16 Feb 2014", 
        "star": "1", 
        "description": "I got this for my mom - My dad has Nexus 4 and that phone is next to perfect.I thought I'll get mom her own Android device, and this fit the bill. Incredible specs - Amazing display (more PPI than my iPhone 5), quad core processor, 1 GB RAM etc and dual sim too.However, most times, my mom is not able to make a call (Unable to Call messages abound). When I try reaching her in either of the SIM, it either doesn't ring or I get 'Out of Service' message. Rebooting the phone temporarily fixes the problem, but eventually problem reappears.The phone shows full signal strength in both SIMs, but, it is both unable to make a call or to receive calls. (Data works with WiFi)I might be hoping foolishly, but I think some software upgrade might fix this.Good phone, may be just my piece is bad. (my bad luck!)"
    }, 
    {
        "date": "17 Feb 2014", 
        "star": "1", 
        "description": "Buying MotoG in combo offer was a bad choice. Flipkart has very bad integrity issues.I have never seen a cheap marketing strategy like this before. I've ordered MotoG on the first day, I was told that Ill be sent Rs 500 + Rs 1000 voucher and also Motorola Flip cover for a discounted price.Guess what !!!!I got the phone which is good, but unfortunately they are not giving me any of the offers. No coupons, no flip cover no nothing. They refunded a cheap Rs.50 and told that the reseller does not have the flip cover !!!!Funny guys, they just put a promo so that everyone can buy the phone and screw up the promo products.I am planning to write comments in every blog site possible.Any of you guys experienced something similar? Please suggest ways to expose such integrity issues."
    }, 
    {
        "date": "21 Mar 2014", 
        "star": "1", 
        "description": "Dear all,Moto g an outstanding product. But facing disappointment by the product.I replaced one moto g. Faced problem with its earpiece speaker. voice was getting shattered from speaker.For that product Flipkart sent an apology saying they have sent defective product by mistake.But now again with other replaced product I am facing the same problem. And this time voice shaterring  is so much worsened i cannot understand what opposite person saying. So i had to restrict my use to msging and whats app.Its a service review not a product.From a disappointed customer."
    }, 
    {
        "date": "08 Feb 2014", 
        "star": "4", 
        "description": "In the box:Moto GWall chargerWired headsetQuick start guides in Hindi and EnglishWarranty cardThe Phone:It's a vibrant HD screen that's just the right size and has a clean, stock Android interface. Viewing angles are limited but I don't mind this because it means people can't peek around your shoulder.The phone feels premium to hold and processing power is good, so's the RAM and the phone barely lags (though it does occasionally slow down when changing apps). The matte back panel of the phone has an extremely pleasing texture but is also a smudge magnet. Also, no screen guard was provided in the box and none can be found on flipkart.Both these problems, however, are solved by the flip cover I purchased with the phone, which is even more premium. The thoughtfully located Moto logo has a depression perfect for my index finger, and the magnetic felt-lined cover will autolock or unlock and clean fingerprints on your phone when you flip it.The Cameras:No amount of smooth scrolling will make up for the halfpenny back camera and the severely inadequate 1.3 MP front camera. Although the camera is capable of shooting slo-mo videos (this is really, really cool), they are grainy and jerky. Movement in the video is not smooth and I can only put this down to low FPS. The camera is unusable in low light and is average at best in normal light. The LED flash is blinding.The Battery:Although it's too soon to say anything about battery life, from my estimates it should do 24 hrs on one full charge with moderate wifi and 3G use.The Accessories:Apart from the phone, everything in the box was majorly disappointing. The headphones feel cheap, sound substandard and are really not worth reviewing. No data cable was included in the box. Instead I received only a micro-usb wall charger. Hello, moto?UPDATE: I attempted to transfer files with several data cables on multiple computers and there is a glaring issue here: the phone does not stay connected for more than two minutes at a time. Windows Explorer hangs when i try to transfer multiple albums simultaneously as they take longer than 2 mins to transfer. When I first plug it into the PC it is recognised as device XT1033 but then 2 mins later it just drops off the PC and all transfers hang. Then I have to manually disconnect and reconnect the data cable, and I have another 2 minute window to transfer files before it drops off again. The phone is charging all this while, though.I am getting in touch with flipkart about this issue.UPDATE 2: I turned on USB debugging through the Developer Options and this has apparently resolved the connection-drop issue. No cause could be found for the issue I faced earlier. I will update if it returns.It is worth noting that the loudspeaker is incredibly powerful and distortion-free. The ear-speaker unit is also fairly loud and does the job.I had come to the comforting conclusion that 8 GB models were finally out of fashion - it's 2014. Evidently I was wrong. I strongly urge everyone to invest the extra 1.5k for a 16 GB model.I must also mention that the power button and volume rockers were crisp and responsive when the phone arrived but have become loose within 8 hours - what the hell?Price - 7/10Build quality - 8/10Pros:Solid build - water resistant, Corning Gorilla Glass 3Premium feelExcellent for everyday useStock Android interface + 4.4 Kitkat update imminentCritically acclaimed price-pointCons:Mediocre cameras - both of emIn-the-box accessories are worthlessNo screenguard included or available online, but problem solved by flipcoverNo expandable memory, though it supports OTGMotorola Device ID - the world renowned lost phone tracker - is not available in IndiaVerdict:Worthy of the hype. Almost worth the price. One of the best deals under 15k.P.s.It took me 6 tries to get to the payment page because by the time I would get there it would be sold out, and I'd have to refresh the product page. Then when I finally placed the order at around 1315 hrs, it kept alternating between &quot;payment succesfully completed&quot; and &quot;transaction incomplete&quot;. Then at 1350 hrs it finally stabilised to &quot;payment successfully completed&quot;. Then flipkart started adding random orders for the 8 GB version which I had never placed. These orders are still visible now in my track orders list, even though I never placed them. They were cancelled when I called their helpline number and they revealed there were multiple technical breakdowns because of a massive influx of customers. I received my phone the next day as per the guarantee."
    }, 
    {
        "date": "07 Mar 2014", 
        "star": "1", 
        "description": "Bought this Moto G phone and there is a damage on the display. Went to the service center but there is not agreement between motorolla and service providers regarding the out of warranty Moto G support.Product has bee sold out before a month ago and till now they didnt finalize the service rules for warranty and no warranty.Very worst support form Motorola."
    }, 
    {
        "date": "26 Feb 2014", 
        "star": "1", 
        "description": "Distributed in Asian countries will have the following:a) standard moto G with black colour moto shellb) motorola earphonesc) moto G screen protectord) motorola chargere) extra random colour moto shell.bt FK not give screen protector &amp; extra shell. Up above comments is officially said on page of motorola on facebook..."
    }
]