[
    {
        "date": "10 Apr 2014", 
        "star": "1", 
        "description": "Main Drawbacks of S5:NO LTE (4G).NO OIS (Optical Image Stabiliser).NO FM Radio.NO Snapdragon Processor.NO 3GB RAM.NO Temperature/Humidity Sensor.NO USB 3.0 CABLE.Surprisingly this phone (Indian Version) despite being a USB 3.0 capable device ships with USB 2.0 cable in the box. Shame on you Samsung, how much will you save by not providing a USB 3.0 cable.Main Advantages of the S5:- Slightly Bigger screen and battery.- Fingerprint scanner.- IP67 Certified - dust and water resistant.- USB 3.0 port.- User replaceable battery.- Micso SD slot.- Better camera at 16 MP.- Plethora of features like Heart rate sensor, Smart Stay, Smart Scroll, Air View, Air Gestures, IR remote, etc.So it does not make sense to buy a &quot;3G&quot; flagship phone, which will be OUTDATED very soon.FINAL WORDS:The phone overall is very good, BUT, the lack of few critical features like 4G (LTE), FM, OIS, etc and the hefty price tag makes it totally unviable proposition. The correct price of this phone should have been less than 39K, which is the price of the 4G (LTE) Snapdragon model in the international market.There are much better phones like Google Nexus 5 with better specs available at much lower price.So, Choose wisely guys, its your hard earned money and precious Foreign Exchange of our country, India."
    }, 
    {
        "date": "21 Apr 2014", 
        "star": "2", 
        "description": "To start with, we have a lot of certified reviews about this product and before i start i have a disclaimer , i have not purchased this product but had used it for many hrs as my roomate has brought it at launch and guess what he is a samsung fanboy..To  be honest, i was a fan of samsung galaxy line of phones and current using S4 -the Sd600 version as my daily driver. This line up of 5  phones together with the note series made samsung what it is today as we all know. The fifth iteration is not a revolutionary one compared to its predecessors, but i admit its fairly a good device..but with more cons than pros... I feel like its a real durable device, its solid, screen is a pleasure to watch, good optics, the pros according to me ends here.. Under the hood and the design is a total disappointment..Samsung's double standards to indian customers in fact is not new. It all started with the S3 which was undoubtedly the best seller in india back then, which was launched with a different chipset and packing in just 1GB of Ram compared to 2Gb in its european counterparts. They followed their racist tradition with the S4 bringing in an another stripped down version of the flagship, which even then managed to ship millions. This is where the problem lies, we indians(not everyone though)are obsessed with branding and do whatever it takes to get an Samsung or an apple or at least a sony, provided, if we have the resources.How many of us will consider buying a gionee or an oppo if we have 40k as our budget.? I bet not somany. This is what Samsung and other OEM's exploit. In China which is another huge market for Samsung, they release special edition dual sim variants of flagships with snapdragon exclusively for, why not in india? Its because in china they have a huge sentiments toward home grown chinese brands, and I'm sure that not even a single piece of this crap with exynos powering them will ever sale if they dont have the competitive edge..The exynos processor powering the s5 in india, is an in house processor developed by samsung. The catch here is that they can make OODLES of PROFIT out of each devices sold because they dont have to share the profit margins with Qualcomm. Exynos is always a loser vs SD.. FORGET the benchmarks results, as Samsung has always found beefing up the benchmark scores - a person with an hands on experience knows the drawbacks of exynos over the snapdragon counterparts. It tends to heat up, consumes more RAM, drains the battery, frequent lags, app compatibility issues, and no LTE.When LTE-A is the global buzz word in mobile technology and oem's are busy pushing out their products In the European market, we still are being fooled around by them. It's not just SAMSUNG but others as well, similar the case with sony z1, the Indian version does not  have the 4G compatibility, while all the other market it sells does. What these guys are thinking? its profit that decides it and nothing else.India is on a smartphone revolution while other markets have become saturated, they  might be trying to ooze out maximum from these market before bringing up a so called premium version with 4G LTE just like what lg did with the new g2. considering recent developments in the Indian telecom sector, im  pretty sure that 4G will be launched by different operators very soon, and the buyers will soon repent on their purchase. When we invest such huge sums of money on a mobile device, who doesn't want it to be future proof-say at-least for the next 2 years???So what are our hopes for a 4G lte (td lte) device??Qualcomm has developed a new communication receiver, which is compatible with all the LTE bands in the world, which is being used on the Apple 5S and 5C. When demand rises for 4G devices,I am pretty sure that Samsung is gonna launch a so called premium versions with SD801 and 4G TDLTE soon and that is going to be their huge marketing gimmick and will price it insanely high( atleast 75k) at launch and trust me there will still be people who will wait in queues to get it. Remember the branding fever that i talked about. The other oem will follow suite.. Again, Soon they will launch another cutting edge technology and we indians will again have to wait another 2 generations of phones to get our hands on that technology.If this has to be stopped, we should stop running after brand name, instead look into specs and quality, and choose wisely. As of now, if you plan to buy a flagship device, i would recommend go for the htc one m8, as it has support to the soon to be launched indian 4G band and is a descent looking phone. Remember there isnt a perfect phone as such.. M8 is not so good at optics and should be priced more...,u have other options if ur looking out for a 4G device in the budget segment also from oems like xolo.. its just a personal opinion, and after all its just me... So choose wisely... Thanks for reading..,,if u found it useful, please do rate it.. Thanks,."
    }, 
    {
        "date": "14 Apr 2014", 
        "star": "1", 
        "description": "following are the benefits of xperia z2 over galaxy s51) Better Processor (snapdragon 801 vs exynos) snapdragron 801 has about 30% better graphics processing power than this exynos in s52) Better Ram (3gb vs galaxy s5 2gb)3) Better screen(IPS PANEL of z2 which produces better color gamut than amoled of s5...amoled is just oversaturated non-natural looking colors)4) Better Camera with better low light images.5) Better Water resistance (xperia z2 is IP58 and galaxy s5 is IP67.......the first digit in IP    represents dust resistance and second digit represents water resistance.....which means xperia z2 for water resistance is 8 vs s5 7 rating....but galaxy s5 has better rating for dustproof)6)Xperia z2 has bigger battery 3200 mAH vs s5's 2800 mAH.7) Much better build quality of aluminium frame and glass than the cheap looking plastic of galaxy s5.8)xperia z2 has better speakers with s-force surround sound.9) xperia z2 has best in-ear music with clear bass, clear stereo and clear phase and noise cancelling feature and the noise cancelling earphones come free with it...MDR-NC31EM...these headphones can only work with xperia z2 and these headphones record ambient noise while playing music and sends a noise cancelling signal to nullify the noise  to headphones but the galaxy s5 comes with cheap headphones with NO BASS so music is never fun on s5."
    }, 
    {
        "date": "11 Apr 2014", 
        "star": "1", 
        "description": "An awesome phone no doubt, has the best display on the planet, IP67 certification.BUT,In India launched with exynos Octa core version which is quite fast, but the games and apps are better optimised for Snapdragon SoC because it is more popular. Samsung( outside India), LG, Sony, HTC, Gionee, Nexus, Oppo, and many other use Snapdragon 800 SoC.So better go for Snapdragon SoC than this.Also it is more battery efficient with built in 4G capabilities. Yeah, S5 has no 4G for 50k,  while LG G2 has just recently launched a 4G model for the  Indian 2300 MHz band.It has big (huge in current scenario) bezels which takes away beauty. Bezel less display like the G2 looks gorgeous and provides rich &amp; immersive experience.The least Samsung could and should have done is to give users the option to choose snapdragon or exynos.."
    }, 
    {
        "date": "11 Apr 2014", 
        "star": "1", 
        "description": "I've lately switched to iPhone 5s from my good old crappy note 2I'll give three reasons for not buying this phone!1.Samsung doesn't maintain their flagship user's standards.... after a month or so s5 neo and later grand 3 will come and they'll all look very similar and will pack identical features and just like s3 it's price will drop to 20k after an year or so2. Exynos crap which doesn't support 4g which is being offered at 3g rates in iPhone 5s in Bangalore by airtel! and  some image stabiliser is absent and above all when the exynos variant of note 3 was launched it couldn't even play high end games like nova 3 because they were not even optimised for it and GTA 3 would come up with some terrible graphics issues and above all the snapdragon variant will always have higher benchmark score and performance ( and please even if it's benchmark score doesn't don't fool yourselves believing that it's slower as note 3 was spotted using a special code to increase its benchmark score by 20 percent by ars technica; they know how to cheat stuff)3. The 4.3 update on galaxy s3 rendered it useless as the device would freeze randomly and you would have to remove the battery and start over again moreover WiFi issues and so the note 2's update was delayed by 20 days and when I got it in my note 2 I faced similar problems and hated Samsung for it that's how they treat their One year old flagship phone usersIts been 5 months since November 20th and Samsung hasn't done anything and yes history repeats itself....... all I can say is choose wisely :-)"
    }, 
    {
        "date": "28 Apr 2014", 
        "star": "1", 
        "description": "Disclaimer: I brought this phone as I am a developer and geek.Main Pros:- Slightly Bigger screen and battery.- Fingerprint scanner. (Not as good as on iPhone 5S)- IP67 Certified - dust and water resistant.- USB 3.0 port. (BUT, No USB 3 Cable in the box!!!)- User replaceable battery.- Micso SD slot.- Better camera at 16 MP. (But does not have OIS)- A lot of sensors like Heart rate sensor, Smart Stay, Smart Scroll, Air View, Air Gestures, IR remote, etc (But lacks Temperature and Humidity sensor this time)Main Cons:- Lacks LTE (4G) (As on iPhone 5S and 5C and LG G2 LTE)- Lacks OIS (Optical Image Stabiliser) (As on LG G2, Nexus 5)- Lacks FM Radio (As on most other flagship phone of different companies)- Lacks Snapdragon Processor (As on all other flagship phones, and even on International version of S5 and Note 3)- Lacks 3GB RAM (As on Note 3, Sony, LG flagship phones)- Lacks Temperature/Humidity Sensor (As on S4 &amp; Note 3)- Lacks USB 3.0 CABLE (As we got in Note 3)This phone is not at all worth the price. Correct price should have been around 37K)"
    }, 
    {
        "date": "25 Apr 2014", 
        "star": "1", 
        "description": "Let me tell you straight.. Shame on you Samsung for dumping this piece of shit to us.  I have the reasons why :-1. S5 look is crap. Beware my Friends, If you are buying this phone. Your colleagues or friends may say Hey Buddy !! Congrats you bought Galaxy Core (A 10,0000 bucks phone). Chances are you will be feeling like throwing this piece of bullshit in pothole, if you cant manage your anger. Even Apple gives such a beautiful phone and software support at that priceVERDICT NO. 1 - LOOKS SUCKS.2. No 4G phone. S5 is a technology obsolete. Buy it now only regret it 3 months after. Indian version - No 4G. They say 4G is not in India. Well Airtel has launched 4G one year before you sick Samsung people. Well The Price of the phone is 5G. How pathetic is that.VERDICT NO. 2 - NO 4G, BUT PRICE IS 5G. HOW SICK.3.  HEART RATE MONITOR IS GIMMICK - Well All those who are really concerned with health for self and family, Buy a treadmill worth Rs. 20,000 - 25,0000  which has inbuilt heart rate monitor. Dude, we all know that Gadgets has made us more lazy and sick. Everyone knows the dark reality of Smartphone usage. This feature is making us a big fool.BUYING THIS PIECE OF SHIT WILL GIVE YOU A HEART ATTACK, SO SAMSUNG HAS GIVEN THIS FEATURE TO PREPARE YOURSELF FOR THE DANGER.VERDICT NO. 3 - GO JOIN A GYM OR BUY A TREADMILL BUT DONT BUY ON THE BASIS OF THIS FUTURE.4. FOR WORLD - QUAD CORE PROCESSORFOR INDIANS - BULLSHIT CORE PROCESSOR.VERDICT NO.4 - WE ALL NEED TO BOYCOTT THIS S5 TO SHOW THIS COMPANY WHAT BLUNDER THEY ARE DOING TO THE COUNTRY WHICH HAS MADE IT A SMARTPHONE LEADER.5.  WORLD'S BEST PHONES ARE - LG G2 , XPERIA Z2 OR Z1 COMPACT, HTC ONE (M8) , MICROMAX CANVAS 4 , MOTO G , S4, LUMIA 920 . (AT THEIR RESPECTIVE PRICES)IT'S WORST INDIAN PHONE.6. CAMERA WITH NO IOS (IMAGE OPTICAL STABILIZATION) .IF YOU ARE BUYING ON THE BASIS OF CAMERA. SONY XPERIA AND NOKIA LUMIA ARE OFFERING 20 MEGAPIXEL DSLR LIKE CAMERA.S5 camera is gimmick, believe it or not. Just check the camera demo live at their store.FULL VERDICT - SAY NO TO S5."
    }, 
    {
        "date": "02 May 2014", 
        "star": "1", 
        "description": "samdung has done it again !!!! as every time its giving the crappy exonys version to india ( any how i dont think even the intl version is any better than this crap) ....no pros only big big big cons:1) ugly looking design ..wtf has samdung designers dont have better ideas for the design????2) cheap plastic build ... fake leather , fake chrome ,fragile crap..3) those finger print scanner and heart rate monitor are just gimmick they are not even presise too. .4) comes with shit load of bloatware.. a 46 k baby monitor anyone??? lol..5) heats up like a portable frying pan.. sereiously....6) drop it in shallow water it has a high chance of back cover getting seperated .. and the so called water proof tech will be not able to save this crap!!!!!7) its got a shitty exonys crap ..( very very big con)8) high chance of failing when its droped from chest height..9) the back looks like an bandaid ( must be an attempt to copy LG g flexes self healing back cover) lol....10) 2 gb ram ??? for the amount of bloat ware it has it must have had 3 g  ram....11) some might even fool you by saleing you S4, S3 and even galaxy grand.. you will never come to know the difference between then by looking from outside..12) no lte ,no radio ..still if you are going to buy this crap you are the biggest fools i can ever imagined...ya and dont forget those apple craps too.. 10 k difference between 5s 32 gb ang 5s 16 gb??? and 69k for 64gb 5s ????? 23k for the outdated 16 gb iphone 4??? we must sue both crapple and samdung from india... theyre just fooling us..."
    }, 
    {
        "date": "14 Apr 2014", 
        "star": "1", 
        "description": "Useless, better get a IPhone or Galxy SIII instead this of laggy bloatware and touchwiz.-Octa Core : Who need 8 cores, 4 core is max for a mobile phone. ?? Useless- S Health, S Planner, bla bla S S S : Who need these bloatware in phones and spend over 50 k ? [ Bloated and Overrated ]- Touchwiz : This is most fail thing is Samsung Phones, which lags almost on every Galaxy Series even of Galaxy S4 and S3. [ Laggy ]- Design : Looks like same as S4 nothing more special. I Recommended to buy a SIII insteadNo 4G : So. now his is enough from Samsung, no LTE support even on 50k.Heating Issue : This issue is common, by several high-end devices of Samsung, and this phone have octa-core Processor. so more heat.Buy a motorcycle instead of this, or buy a IPhone. Good luck, Avoid these crappy things from Samsung."
    }, 
    {
        "date": "20 Jun 2014", 
        "star": "1", 
        "description": "I have been stupid to buy so many items from flipkart. I bought a samsung S5 and as soon as I started using it, it gave several issues like getting restarted, going on headphone mode automatically etc. I sent several mails and talked to the customer support but it was of no help. I was finally told that my set will not be replaced. I wonder if you've failed to realize that i was asking for a replacement and not refund. Also, what is the manufacturer warranty   for? Is it that once you've sold the product, you just don't give a damn. You've converted a loyal customer into an Irate and I will make sure that I put my review about flipkart on all the possible forums."
    }
]