[
    {
        "date": "03 Aug 2013", 
        "star": "4", 
        "description": "Trust me guys, I never wrote reviews on Flipkart ever, but this one really deserves it.First of, this phone has a 1080p screen with Sony's Triluminos and OptiContrast display (they normally use it in their LED Televisions), also Adreno 330 (stock frequency as 320) with Snapdragon series 800 chipset which packs 4 Krait cores at clocked 2.2 GHz each. Only these specs are enough to justify that this phablet is nothing but a Multimedia Package. Needless to say, your Blu Ray movies, 3D games and overall feel of the GUI will be like smooth as butter.I only wonder WHY in the World, WHY did Sony not even bother to add an extra speaker to the phone? It has a monaural sound (only one speaker). And I agree that the camera does not require a flash, still an LED flash would have been a needful addition. With so much money in, you can't let yourself compromise on anything. Hats off to the engineers at Sony for creating a literal benchmark for Android phones (at least for this year), but I bet they must have thought about this. Overall, a good phone. But people giving importance to battery life, external audio and flash, beware."
    }, 
    {
        "date": "24 Sep 2013", 
        "star": "5", 
        "description": "This phone is totaly outsatnding , every feature is work great but in my opinion the new xperia Z1 is better option if you understand comparition of both phones feature.1 ) Both has android 4.2 jellybean , single sim &amp; adreno 300 graphics , So its Ok.2) Both has 2.2 ghz qualcomm snapdragon 800 , quad core processor , so its ok is well.3) Now come to the size feature , xperia Z ultra has 6.4 inches full hd screen &amp; Xperia Z-1 has 5 inches full hd screen So in my point of view a smart phones perfect size is 5 inches screen &amp; comfortable is well ,  Xperia z ultra has 6.4 inches huge screen , which looks like phablet Or Tablet , So in size feature , your choice which size you prefer.4 ) Now most important &amp; main feature is Camera. Xperia Z ultra has 8.0 Mega-pixles primary camera &amp; 2.0 mega pixles front camera , So it can capture good images &amp; yes 16x zoom is well But now come Z-1 / This phone has a 20.7 mega pixles unbelievable camera &amp; 2.0 mega pixles front camera with 8x zoom. I think you can understand that Even cyber-shot camera's 14 to 16 mega pixle camera captures awesome pics So imagine a 20.7 mega pixle with 8X zoom , Realy rocks. So Z-1 wins in this is well.5 ) Now all other feautures of both phones are same , some screen &amp; camera's 2-3 feauture is different but its not big deal , Bettery has some difference which Z ultra has 3050 Mah bettery &amp; Z-1 has 3000 Mah bettery So in my point of view not a huge difference.So , Both phones are great , This 2 mobiles , which ever you'll buy , you'll have no regrets But i only want to show you some differences of this 2 Beasts. Thank you."
    }, 
    {
        "date": "08 Aug 2013", 
        "star": "5", 
        "description": "Got this phone a week ago!!..great packaging wil say!!..;)Tested it to its limits..nd here's my verdict..The first impression of the phone its 17.9 cm in length!!!..on the front side is a HUGE 6.44&quot; LCD screen with triluminous display and is backed up by bravia engine 2..on the back..we have a 8mp camera nd no lED flash..but the lack of flash is made up by the exmor sensor which the Z ultra is first phone to have!..so dont worry about clicking pics in dark..they will be good..but not like the lumia..which excels on low light photography..but hey!..Z ultra is 1.5 m waterproof in fresh water..trust me..u would really like to try this..tested in a swimming pool..don't know of salt water..but works great upto a 150 cm in fresh water..Seriously the phone is a fingerprint magnet!!.. I got the cover as complimentary gift from the store..so my phone is clean..:pOkay now to business..Outer specs-1) rear 8mp nd front 2mp camera..both capable of recording 1080 HD videos.2) 6.44&quot; display which covers up most of the front.3) waterproff nd dust resistant..4)docking port on left side..which is kinda cool..to watch movies nd charge the phone at the same time!!5)ultra super slim..just 6.5 mm or 0.65 cm in thickness..its the slimmest smartphone in the market right now!6) the phone is literally enclosed in toughened glass..u wil need a jack hammer to break it!!7) makes a hell of an impression on onlookers!!..:DInner specs-1) CPU - the true beast within the beast!..a 2.2GHZ quad core possessor with snapdragon 800 chipset..and awesome GPU..so high end games can be played with ease..this is the first phone to have it..2) 2 GB RAM which is more than enough!3) Android 4.2 (jellybean) we have lockscreen widgets..which is really cool!..a possible upgrade to 4.3 is around the corner..which will have profile.access control..to limit what data the apps can read..great security feature!4)16GB onboard memory..with sd card slot..expandable upto 64GB5)\tTHE BATTERY!!..we gave a monstrous 3050 mAh battery..which cannot be removed..its a downside to get the phone waterproof..with heavy usage nd full time 3G..mine lasted for almost 14 hours.. I actually kept apps running in background to check it..works great..the phone is actually battery concious..it puts itself in deep sleep mode when not in use..so u have only wireless connections and speakers on..rest is put to slumber!!6)NFC ready,bluetooth 4.0,wifi,GPS,GLONASS,etc..the NFC is good..coz u have loads of accessories..like the speaker..i got that too..has a good range..That's enough I think!..the phone retails for about 45K online..so its a little on higher side..but stores offer EMI option..so if u have that kind of money..go for it..u surely will be happy when u lay hands on it!.."
    }, 
    {
        "date": "18 Feb 2014", 
        "star": "5", 
        "description": "If you are normal user with very normal requirements, or just a power user who needs just the best configuration and nothing else with an obvious need for comfort or if you have a rich dad and you don't mind spending 40k to brag, this review is not for you.The first thing to note about this phone here is that it should be declared a Collectors Item! With its humongous size, this product caters to a very niche category and for a genuine review you should consider a user who bought this phone, as this is the only phone that satisfies all his/her needs.With the configuration available for public view, it is no secret that the Z Ultra smokes all other phones in any performance benchmark. Its a no brainer and there are literally no Apps or Games out there that can push it to even close to what you can call ITS LIMITS. As of now, we need the Software Ecosystem to develop at a faster rate than the Hardware currently is.I would like to mention that I was looking for the largest device available that can satisfy the needs of a tablet, phone and to a certain extent a Laptop. I considered the ASUS Fonepad ( too low performance for my needs), Galaxy Note 3 (insanely expensive, plus Samsung Quality (I'm sure you understand that a value buyer will not like to fork out 43k for a plastic body construction. When I'm spending that much, I want a Jewel that performs. A beauty with brains to be precise), the and some other android tablets at a lower cost. The quintessential requirement was of a device that I can carry around all day and it caters to all my needs. I love reading so definitely a crisp and big display (1080p and 6+ screen a must here, as it should match the Kindle that I generally use). I am a an avid music lover and my taste ranges from Kailesh Kher to Nightwish. This naturally converts to huge space requirements and a device that can do justice to the Sony Walkman, legend of the music industry. I can't stand subpar  audio quality as well. There was a time when I used to spend my entire pocket money on Game Parlours, so though not a Playstation, my device should be able to play Games well (I'm not the Fruit Ninja or Subway Surfer kind either, I love very few games and all of them are Graphic Intensive).With all these needs, I started looking at the market and at my astonishment I couldn't find any other device and to this I was even more amazed, this was Tailor Made to suit my requirements.The build is amazing, a piece of Art as I mentioned earlier. Insanely fast, watching Videos on the Screen is a feast. Its has just the perfect brightness and vividness for a screen. Not that I hate Samsung's over-saturated AMOLEDs, but sometimes it fakes so much that you lose sense of reality. The   Apps launch instantaneously and there is no lag whatsoever. Minimally modded Android, apart from a few things its basically stock and this adds to the smoothness. The leather cover is amazing and adds to the premiumness. The External Battery provided is a must for frequent travelers. I'm usually on official trips and this will definitely help me. I switched on the STAMINA APP and it has been delivering decent backup for a power packed device of this stature. The screen sucks in 75% of the power. The device will last for an Entire day worth of usage (I don't play a lot of Games while sitting in Office, but yes 3-4 hours of Music including some videos, 5 hours of browsing, about 3 hours of reading during the commute hours and about 2-3 hours of Voice calls.The size is big and mind you, if there is the slightest hint of doubt in your mind quit the idea, its not for you. For the same reason, I have not had a problem and I was at home with the device right from the 1st instance.I ordered the following accessories:1) 64GB Sandisk Extreme microSD.2) USB OTG for my external hard drive.If you have the same requirements as I have and really do not give a Nigerian rat's ass to what people say when you put that piece of beauty to your ears, this is the best that money can buy you for a premium smartphone experience. Period.P.S. I have read quite a lot of negative reviews on the Camera. Not to be biased here, I'll like to state that I'v had a tablet and a phone since the past 2 years and never clicked more than 5 pics combined as I look back now. I have a DSLR too and I always carry it around if I intend to click. No matter the zillion pixels you pack in, the camera is still going to have a stupidly small sensor and if you ask the enthusiasts again, there is a lot more to photography than plain MEGAPIXELS. My friend's Z1 was supposedly a good snapper for the 1st week and since he too has a DSLR, he has stopped using the 21MP camera of his Z1 in favour of his 14MP Canon (if only MPs meant everything). For people who will actually use the device to snap a lot, I don't know what to say."
    }, 
    {
        "date": "28 Oct 2013", 
        "star": "5", 
        "description": "Purchased this phone on 15th October, Got delivered on 17th October.This is a very unique device.Its big, but once you get used to it, 5 inch devices (like Xperia Z &amp; Z1) will seem to be too small. Fabulous user experience.Coupled with all the offers facilitated by Flipkart and Standard Chartered Bank (15th-19th Oct Pre-Diwali sale); I got this phone at an unbelievable price and with a lot of freebies.1. Portable Charger from Sony 5000mAh2. Everready Portable Charger from Flipkart/W.S.Retail 2200mAh3. Bluetooth earpiece.4. Premium flip-cover from Sony.About the device:Pros1. Size2. Tri-luminous display3. Speed (2.2 Ghz Quad Core)4. Aluminum frame.5. Uniqueness.6. Waterproof construction (Havn`t yet tried it, but should be good)7. GLONASSCons1. Size2. No Flash.3. Big battery needs big charging time.For me, this device has helped me replace 3 devices1. Mobile Phone2. Tablet3. Sat Nav.Thank you flipkart for an outstanding service as always!"
    }, 
    {
        "date": "08 Apr 2014", 
        "star": "1", 
        "description": "I had purchased Xperia Z a year back and on April 2014 its warranty expired. And i accidentally dropped my phone and its screen cracked. It became completely unusable and the service centre guys say it can only be replaced not repaired and that too for 17k. But since i lost my earphones, there are not ready to do anything with my phone as they need all of the original accessories. The customer care guys say everything is dependent on the people of service centre and to talk to them. The original earphones is not available anywhere, so finally i ended up with a piece of unusable crap now. Sony service is the worst, and neither the service centre guys nor the customer care people are telling me what to do next.I searched a lot in net and found for many people the replacements were refurbished ones, not new ones, some even with scratches and other hardware defects and those were under warranty, sony is cheating customers. All these good ratings and reviews are misleading, once something happens to your phone, you will have to go through a terrible experience since sony now sucks at everything other than making advertisements."
    }, 
    {
        "date": "18 Aug 2013", 
        "star": "4", 
        "description": "PROS:1) The size of the phones display is the main selling point. The display is very good with natural realistic colors. No more washed out viewing angle problems.2) Phone's build quality is top notch. Very few phones come close to this phones build quality.3) Water proofing &amp; dust resistance always helps.4) Phone is ultra sleek which really helps while using it &amp; pocketing it.5) This phone makes you stand out from the crowd.5) Watching movies, playing games, web browsing experiences are unmatched in smart phone category.6) Phone doubles up as a tablet during leisure hours.7) Hardware inside the phone is unrivalled at the moment. Super fast &amp; smooth performance.8) Though it has a low battery life, the phone charges itself fairly quickly.CONS:1) People will find pocketing this phone &amp; carrying it around difficult.2) Battery life is unacceptable. You will have to charge it at least twice daily. Added to that, the inconvenience of a non-removable battery. Don't know what will happen once the phones sealed battery inside loses its functionality.3) Lack of a photo camera flash produces blurred or noisy photos in lowlight conditions.4) Apps cannot be transferred to a SD card.5) Lacks a proper built in stylus.6) You need to open &amp; close the charging port flap properly every time you charge the phone which seems to be a bit annoying.7) You need to carry an external power bank along with this phone.8) Speaker sound volume is too low."
    }, 
    {
        "date": "29 Oct 2013", 
        "star": "4", 
        "description": "Guys trust me. This is a a complete entertainment smartphone.Bought this a month ago and the performance has been phenomenal. All the difficulties that i faced with s3 and note 2 are gone. Those who feel the phone is too big and impractical for daily use, should atleast use it for once. I am sure their opinions would change.PROS:1. Snapdragon 800 processor (best you can get in the market right now).2. Watching movies and playing HD games is amazing.3. UI is somewhat closer to the stock android.4. Ultra slim body makes it easier to hold it in your palm.5. Free flip cover unlike samsung phones where you have to shell out few more thousand bucks after purchasing such an expensive phone.6. Classy finish on the design.CONS:1. No flash. (Most of the users don't need flash that often. Clicks pretty good pictures in the daylight with minimal noise).2. Red pixel issue. (It is there in few sets. You get a red pixel on the top left and bottom left corner of the screen which is really annoying. This is a software problem that has disappeared after the latest update.)So guys i hope this review helps..."
    }, 
    {
        "date": "04 Aug 2013", 
        "star": "5", 
        "description": "Brought the phone yesterday .Display is mind blowing . Also ultra fast with such huge screen.Design is sleek and compact - Giving it a privileged look.Although I thought it wont fit in pocket - But surprised to see it slide in quite well :).As some people already mentioned - Camera(no LED) + Speaker are the downsides of this phone - However Sony headsets are superb as always .. The size too matters for persons who likes to hold the phone to their ears to talk :).  Better to use wireless technologies for that if you use this phone for that!.This phone is best in the market for&gt; watching crystal clear movies and pictures&gt; browsing and downloads&gt; reading books/ mags/news - The large size with display greatly helps in this regard&gt; Gaming - Superb Graphics powerIts a real phablet - meeting the requirements of a high tech Tab + up to date 3G/LTE HSDPA phone"
    }, 
    {
        "date": "07 Nov 2013", 
        "star": "4", 
        "description": "It is what you would expect from recent Xperia devices. Brilliant display, a lightly themed overlay over stock Android and a premium glass finish.It surely is excessively big for a phone. Don't expect it to fit in your pocket, because it wont.Viewing angles are pretty decent. However I was not very much impressed with the XReality Engine. It works very well with Full HD movies. But we must remember that most of us would be watching HD or DVDRips on it more often. For such videos, XReality only ends up spoiling the experience with over-the-top color saturation and increased sharpness. Disabling it however brings things back to normal.Placement of the loudspeaker leaves a lot to be desired. There's a single speaker (which I feel is insufficient for such a large device). The speaker is placed at the bottom, where your lower palm usually rests while gripping the phone. The result is that you inadvertently end up locking the speaker output, reducing volume levels and hindering your gaming experience. The headsets hoever are top-notch.Lastly, the camera. If you're too much of a photography junkie, then you will be disappointed. The camera is surprisingly bad, really bad. Too much JPEG compression causes images to come out average - something not expected from such a high end device. Lack of flash is no biggie as compared to the worse overall camera experience.All in all a good phone. Would recommend to those who do not own tablets and want to experience both types of devices in one."
    }
]